MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
extern volatile PID1K3Hbits_t PID1K3Hbits __at(0x595);
// bitfield macros
#define _PID1K3H_PID1K38_POSN                               0x0
#define _PID1K3H_PID1K38_POSITION                           0x0
#define _PID1K3H_PID1K38_SIZE                               0x1
#define _PID1K3H_PID1K38_LENGTH                             0x1
#define _PID1K3H_PID1K38_MASK                               0x1
#define _PID1K3H_PID1K39_POSN                               0x1
#define _PID1K3H_PID1K39_POSITION                           0x1
#define _PID1K3H_PID1K39_SIZE                               0x1
#define _PID1K3H_PID1K39_LENGTH                             0x1
#define _PID1K3H_PID1K39_MASK                               0x2
#define _PID1K3H_PID1K310_POSN                              0x2
#define _PID1K3H_PID1K310_POSITION                          0x2
#define _PID1K3H_PID1K310_SIZE                              0x1
#define _PID1K3H_PID1K310_LENGTH                            0x1
#define _PID1K3H_PID1K310_MASK                              0x4
#define _PID1K3H_PID1K311_POSN                              0x3
#define _PID1K3H_PID1K311_POSITION                          0x3
#define _PID1K3H_PID1K311_SIZE                              0x1
#define _PID1K3H_PID1K311_LENGTH                            0x1
#define _PID1K3H_PID1K311_MASK                              0x8
#define _PID1K3H_PID1K312_POSN                              0x4
#define _PID1K3H_PID1K312_POSITION                          0x4
#define _PID1K3H_PID1K312_SIZE                              0x1
#define _PID1K3H_PID1K312_LENGTH                            0x1
#define _PID1K3H_PID1K312_MASK                              0x10
#define _PID1K3H_PID1K313_POSN                              0x5
#define _PID1K3H_PID1K313_POSITION                          0x5
#define _PID1K3H_PID1K313_SIZE                              0x1
#define _PID1K3H_PID1K313_LENGTH                            0x1
#define _PID1K3H_PID1K313_MASK                              0x20
#define _PID1K3H_PID1K314_POSN                              0x6
#define _PID1K3H_PID1K314_POSITION                          0x6
#define _PID1K3H_PID1K314_SIZE                              0x1
#define _PID1K3H_PID1K314_LENGTH                            0x1
#define _PID1K3H_PID1K314_MASK                              0x40
#define _PID1K3H_PID1K315_POSN                              0x7
#define _PID1K3H_PID1K315_POSITION                          0x7
#define _PID1K3H_PID1K315_SIZE                              0x1
#define _PID1K3H_PID1K315_LENGTH                            0x1
#define _PID1K3H_PID1K315_MASK                              0x80
#define _PID1K3H_K38_POSN                                   0x0
#define _PID1K3H_K38_POSITION                               0x0
#define _PID1K3H_K38_SIZE                                   0x1
#define _PID1K3H_K38_LENGTH                                 0x1
#define _PID1K3H_K38_MASK                                   0x1
#define _PID1K3H_K39_POSN                                   0x1
#define _PID1K3H_K39_POSITION                               0x1
#define _PID1K3H_K39_SIZE                                   0x1
#define _PID1K3H_K39_LENGTH                                 0x1
#define _PID1K3H_K39_MASK                                   0x2
#define _PID1K3H_K310_POSN                                  0x2
#define _PID1K3H_K310_POSITION                              0x2
#define _PID1K3H_K310_SIZE                                  0x1
#define _PID1K3H_K310_LENGTH                                0x1
#define _PID1K3H_K310_MASK                                  0x4
#define _PID1K3H_K311_POSN                                  0x3
#define _PID1K3H_K311_POSITION                              0x3
#define _PID1K3H_K311_SIZE                                  0x1
#define _PID1K3H_K311_LENGTH                                0x1
#define _PID1K3H_K311_MASK                                  0x8
#define _PID1K3H_K312_POSN                                  0x4
#define _PID1K3H_K312_POSITION                              0x4
#define _PID1K3H_K312_SIZE                                  0x1
#define _PID1K3H_K312_LENGTH                                0x1
#define _PID1K3H_K312_MASK                                  0x10
#define _PID1K3H_K313_POSN                                  0x5
#define _PID1K3H_K313_POSITION                              0x5
#define _PID1K3H_K313_SIZE                                  0x1
#define _PID1K3H_K313_LENGTH                                0x1
#define _PID1K3H_K313_MASK                                  0x20
#define _PID1K3H_K314_POSN                                  0x6
#define _PID1K3H_K314_POSITION                              0x6
#define _PID1K3H_K314_SIZE                                  0x1
#define _PID1K3H_K314_LENGTH                                0x1
#define _PID1K3H_K314_MASK                                  0x40
#define _PID1K3H_K315_POSN                                  0x7
#define _PID1K3H_K315_POSITION                              0x7
#define _PID1K3H_K315_SIZE                                  0x1
#define _PID1K3H_K315_LENGTH                                0x1
#define _PID1K3H_K315_MASK                                  0x80

// Register: PID1OUT
#define PID1OUT PID1OUT
#ifndef _LIB_BUILD
asm("PID1OUT equ 0596h");
#endif

// Register: PID1OUTLL
#define PID1OUTLL PID1OUTLL
extern volatile unsigned char           PID1OUTLL           __at(0x596);
#ifndef _LIB_BUILD
asm("PID1OUTLL equ 0596h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1OUT0               :1;
        unsigned PID1OUT1               :1;
        unsigned PID1OUT2               :1;
        unsigned PID1OUT3               :1;
        unsigned PID1OUT4               :1;
        unsigned PID1OUT5               :1;
        unsigned PID1OUT6               :1;
        unsigned PID1OUT7               :1;
    };
    struct {
        unsigned OUT0                   :1;
        unsigned OUT1                   :1;
        unsigned OUT2                   :1;
        unsigned OUT3                   :1;
        unsigned OUT4                   :1;
        unsigned OUT5                   :1;
        unsigned OUT6                   :1;
        unsigned OUT7                   :1;
    };
} PID1OUTLLbits_t;
extern volatile PID1OUTLLbits_t PID1OUTLLbits __at(0x596);
// bitfield macros
#define _PID1OUTLL_PID1OUT0_POSN                            0x0
#define _PID1OUTLL_PID1OUT0_POSITION                        0x0
#define _PID1OUTLL_PID1OUT0_SIZE                            0x1
#define _PID1OUTLL_PID1OUT0_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT0_MASK                            0x1
#define _PID1OUTLL_PID1OUT1_POSN                            0x1
#define _PID1OUTLL_PID1OUT1_POSITION                        0x1
#define _PID1OUTLL_PID1OUT1_SIZE                            0x1
#define _PID1OUTLL_PID1OUT1_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT1_MASK                            0x2
#define _PID1OUTLL_PID1OUT2_POSN                            0x2
#define _PID1OUTLL_PID1OUT2_POSITION                        0x2
#define _PID1OUTLL_PID1OUT2_SIZE                            0x1
#define _PID1OUTLL_PID1OUT2_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT2_MASK                            0x4
#define _PID1OUTLL_PID1OUT3_POSN                            0x3
#define _PID1OUTLL_PID1OUT3_POSITION                        0x3
#define _PID1OUTLL_PID1OUT3_SIZE                            0x1
#define _PID1OUTLL_PID1OUT3_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT3_MASK                            0x8
#define _PID1OUTLL_PID1OUT4_POSN                            0x4
#define _PID1OUTLL_PID1OUT4_POSITION                        0x4
#define _PID1OUTLL_PID1OUT4_SIZE                            0x1
#define _PID1OUTLL_PID1OUT4_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT4_MASK                            0x10
#define _PID1OUTLL_PID1OUT5_POSN                            0x5
#define _PID1OUTLL_PID1OUT5_POSITION                        0x5
#define _PID1OUTLL_PID1OUT5_SIZE                            0x1
#define _PID1OUTLL_PID1OUT5_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT5_MASK                            0x20
#define _PID1OUTLL_PID1OUT6_POSN                            0x6
#define _PID1OUTLL_PID1OUT6_POSITION                        0x6
#define _PID1OUTLL_PID1OUT6_SIZE                            0x1
#define _PID1OUTLL_PID1OUT6_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT6_MASK                            0x40
#define _PID1OUTLL_PID1OUT7_POSN                            0x7
#define _PID1OUTLL_PID1OUT7_POSITION                        0x7
#define _PID1OUTLL_PID1OUT7_SIZE                            0x1
#define _PID1OUTLL_PID1OUT7_LENGTH                          0x1
#define _PID1OUTLL_PID1OUT7_MASK                            0x80
#define _PID1OUTLL_OUT0_POSN                                0x0
#define _PID1OUTLL_OUT0_POSITION                            0x0
#define _PID1OUTLL_OUT0_SIZE                                0x1
#define _PID1OUTLL_OUT0_LENGTH                              0x1
#define _PID1OUTLL_OUT0_MASK                                0x1
#define _PID1OUTLL_OUT1_POSN                                0x1
#define _PID1OUTLL_OUT1_POSITION                            0x1
#define _PID1OUTLL_OUT1_SIZE                                0x1
#define _PID1OUTLL_OUT1_LENGTH                              0x1
#define _PID1OUTLL_OUT1_MASK                                0x2
#define _PID1OUTLL_OUT2_POSN                                0x2
#define _PID1OUTLL_OUT2_POSITION                            0x2
#define _PID1OUTLL_OUT2_SIZE                                0x1
#define _PID1OUTLL_OUT2_LENGTH                              0x1
#define _PID1OUTLL_OUT2_MASK                                0x4
#define _PID1OUTLL_OUT3_POSN                                0x3
#define _PID1OUTLL_OUT3_POSITION                            0x3
#define _PID1OUTLL_OUT3_SIZE                                0x1
#define _PID1OUTLL_OUT3_LENGTH                              0x1
#define _PID1OUTLL_OUT3_MASK                                0x8
#define _PID1OUTLL_OUT4_POSN                                0x4
#define _PID1OUTLL_OUT4_POSITION                            0x4
#define _PID1OUTLL_OUT4_SIZE                                0x1
#define _PID1OUTLL_OUT4_LENGTH                              0x1
#define _PID1OUTLL_OUT4_MASK                                0x10
#define _PID1OUTLL_OUT5_POSN                                0x5
#define _PID1OUTLL_OUT5_POSITION                            0x5
#define _PID1OUTLL_OUT5_SIZE                                0x1
#define _PID1OUTLL_OUT5_LENGTH                              0x1
#define _PID1OUTLL_OUT5_MASK                                0x20
#define _PID1OUTLL_OUT6_POSN                                0x6
#define _PID1OUTLL_OUT6_POSITION                            0x6
#define _PID1OUTLL_OUT6_SIZE                                0x1
#define _PID1OUTLL_OUT6_LENGTH                              0x1
#define _PID1OUTLL_OUT6_MASK                                0x40
#define _PID1OUTLL_OUT7_POSN                                0x7
#define _PID1OUTLL_OUT7_POSITION                            0x7
#define _PID1OUTLL_OUT7_SIZE                                0x1
#define _PID1OUTLL_OUT7_LENGTH                              0x1
#define _PID1OUTLL_OUT7_MASK                                0x80

// Register: PID1OUTLH
#define PID1OUTLH PID1OUTLH
extern volatile unsigned char           PID1OUTLH           __at(0x597);
#ifndef _LIB_BUILD
asm("PID1OUTLH equ 0597h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1OUT8               :1;
        unsigned PID1OUT9               :1;
        unsigned PID1OUT10              :1;
        unsigned PID1OUT11              :1;
        unsigned PID1OUT12              :1;
        unsigned PID1OUT13              :1;
        unsigned PID1OUT14              :1;
        unsigned PID1OUT15              :1;
    };
    struct {
        unsigned OUT8                   :1;
        unsigned OUT9                   :1;
        unsigned OUT10                  :1;
        unsigned OUT11                  :1;
        unsigned OUT12                  :1;
        unsigned OUT13                  :1;
        unsigned OUT14                  :1;
        unsigned OUT15                  :1;
    };
} PID1OUTLHbits_t;
extern volatile PID1OUTLHbits_t PID1OUTLHbits __at(0x597);
// bitfield macros
#define _PID1OUTLH_PID1OUT8_POSN                            0x0
#define _PID1OUTLH_PID1OUT8_POSITION                        0x0
#define _PID1OUTLH_PID1OUT8_SIZE                            0x1
#define _PID1OUTLH_PID1OUT8_LENGTH                          0x1
#define _PID1OUTLH_PID1OUT8_MASK                            0x1
#define _PID1OUTLH_PID1OUT9_POSN                            0x1
#define _PID1OUTLH_PID1OUT9_POSITION                        0x1
#define _PID1OUTLH_PID1OUT9_SIZE                            0x1
#define _PID1OUTLH_PID1OUT9_LENGTH                          0x1
#define _PID1OUTLH_PID1OUT9_MASK                            0x2
#define _PID1OUTLH_PID1OUT10_POSN                           0x2
#define _PID1OUTLH_PID1OUT10_POSITION                       0x2
#define _PID1OUTLH_PID1OUT10_SIZE                           0x1
#define _PID1OUTLH_PID1OUT10_LENGTH                         0x1
#define _PID1OUTLH_PID1OUT10_MASK                           0x4
#define _PID1OUTLH_PID1OUT11_POSN                           0x3
#define _PID1OUTLH_PID1OUT11_POSITION                       0x3
#define _PID1OUTLH_PID1OUT11_SIZE                           0x1
#define _PID1OUTLH_PID1OUT11_LENGTH                         0x1
#define _PID1OUTLH_PID1OUT11_MASK                           0x8
#define _PID1OUTLH_PID1OUT12_POSN                           0x4
#define _PID1OUTLH_PID1OUT12_POSITION                       0x4
#define _PID1OUTLH_PID1OUT12_SIZE                           0x1
#define _PID1OUTLH_PID1OUT12_LENGTH                         0x1
#define _PID1OUTLH_PID1OUT12_MASK                           0x10
#define _PID1OUTLH_PID1OUT13_POSN                           0x5
#define _PID1OUTLH_PID1OUT13_POSITION                       0x5
#define _PID1OUTLH_PID1OUT13_SIZE                           0x1
#define _PID1OUTLH_PID1OUT13_LENGTH                         0x1
#define _PID1OUTLH_PID1OUT13_MASK                           0x20
#define _PID1OUTLH_PID1OUT14_POSN                           0x6
#define _PID1OUTLH_PID1OUT14_POSITION                       0x6
#define _PID1OUTLH_PID1OUT14_SIZE                           0x1
#define _PID1OUTLH_PID1OUT14_LENGTH                         0x1
#define _PID1OUTLH_PID1OUT14_MASK                           0x40
#define _PID1OUTLH_PID1OUT15_POSN                           0x7
#define _PID1OUTLH_PID1OUT15_POSITION                       0x7
#define _PID1OUTLH_PID1OUT15_SIZE                           0x1
#define _PID1OUTLH_PID1OUT15_LENGTH                         0x1
#define _PID1OUTLH_PID1OUT15_MASK                           0x80
#define _PID1OUTLH_OUT8_POSN                                0x0
#define _PID1OUTLH_OUT8_POSITION                            0x0
#define _PID1OUTLH_OUT8_SIZE                                0x1
#define _PID1OUTLH_OUT8_LENGTH                              0x1
#define _PID1OUTLH_OUT8_MASK                                0x1
#define _PID1OUTLH_OUT9_POSN                                0x1
#define _PID1OUTLH_OUT9_POSITION                            0x1
#define _PID1OUTLH_OUT9_SIZE                                0x1
#define _PID1OUTLH_OUT9_LENGTH                              0x1
#define _PID1OUTLH_OUT9_MASK                                0x2
#define _PID1OUTLH_OUT10_POSN                               0x2
#define _PID1OUTLH_OUT10_POSITION                           0x2
#define _PID1OUTLH_OUT10_SIZE                               0x1
#define _PID1OUTLH_OUT10_LENGTH                             0x1
#define _PID1OUTLH_OUT10_MASK                               0x4
#define _PID1OUTLH_OUT11_POSN                               0x3
#define _PID1OUTLH_OUT11_POSITION                           0x3
#define _PID1OUTLH_OUT11_SIZE                               0x1
#define _PID1OUTLH_OUT11_LENGTH                             0x1
#define _PID1OUTLH_OUT11_MASK                               0x8
#define _PID1OUTLH_OUT12_POSN                               0x4
#define _PID1OUTLH_OUT12_POSITION                           0x4
#define _PID1OUTLH_OUT12_SIZE                               0x1
#define _PID1OUTLH_OUT12_LENGTH                             0x1
#define _PID1OUTLH_OUT12_MASK                               0x10
#define _PID1OUTLH_OUT13_POSN                               0x5
#define _PID1OUTLH_OUT13_POSITION                           0x5
#define _PID1OUTLH_OUT13_SIZE                               0x1
#define _PID1OUTLH_OUT13_LENGTH                             0x1
#define _PID1OUTLH_OUT13_MASK                               0x20
#define _PID1OUTLH_OUT14_POSN                               0x6
#define _PID1OUTLH_OUT14_POSITION                           0x6
#define _PID1OUTLH_OUT14_SIZE                               0x1
#define _PID1OUTLH_OUT14_LENGTH                             0x1
#define _PID1OUTLH_OUT14_MASK                               0x40
#define _PID1OUTLH_OUT15_POSN                               0x7
#define _PID1OUTLH_OUT15_POSITION                           0x7
#define _PID1OUTLH_OUT15_SIZE                               0x1
#define _PID1OUTLH_OUT15_LENGTH                             0x1
#define _PID1OUTLH_OUT15_MASK                               0x80

// Register: PID1OUTHL
#define PID1OUTHL PID1OUTHL
extern volatile unsigned char           PID1OUTHL           __at(0x598);
#ifndef _LIB_BUILD
asm("PID1OUTHL equ 0598h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1OUT16              :1;
        unsigned PID1OUT17              :1;
        unsigned PID1OUT18              :1;
        unsigned PID1OUT19              :1;
        unsigned PID1OUT20              :1;
        unsigned PID1OUT21              :1;
        unsigned PID1OUT22              :1;
        unsigned PID1OUT23              :1;
    };
    struct {
        unsigned OUT16                  :1;
        unsigned OUT17                  :1;
        unsigned OUT18                  :1;
        unsigned OUT19                  :1;
        unsigned OUT20                  :1;
        unsigned OUT21                  :1;
        unsigned OUT22                  :1;
        unsigned OUT23                  :1;
    };
} PID1OUTHLbits_t;
extern volatile PID1OUTHLbits_t PID1OUTHLbits __at(0x598);
// bitfield macros
#define _PID1OUTHL_PID1OUT16_POSN                           0x0
#define _PID1OUTHL_PID1OUT16_POSITION                       0x0
#define _PID1OUTHL_PID1OUT16_SIZE                           0x1
#define _PID1OUTHL_PID1OUT16_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT16_MASK                           0x1
#define _PID1OUTHL_PID1OUT17_POSN                           0x1
#define _PID1OUTHL_PID1OUT17_POSITION                       0x1
#define _PID1OUTHL_PID1OUT17_SIZE                           0x1
#define _PID1OUTHL_PID1OUT17_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT17_MASK                           0x2
#define _PID1OUTHL_PID1OUT18_POSN                           0x2
#define _PID1OUTHL_PID1OUT18_POSITION                       0x2
#define _PID1OUTHL_PID1OUT18_SIZE                           0x1
#define _PID1OUTHL_PID1OUT18_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT18_MASK                           0x4
#define _PID1OUTHL_PID1OUT19_POSN                           0x3
#define _PID1OUTHL_PID1OUT19_POSITION                       0x3
#define _PID1OUTHL_PID1OUT19_SIZE                           0x1
#define _PID1OUTHL_PID1OUT19_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT19_MASK                           0x8
#define _PID1OUTHL_PID1OUT20_POSN                           0x4
#define _PID1OUTHL_PID1OUT20_POSITION                       0x4
#define _PID1OUTHL_PID1OUT20_SIZE                           0x1
#define _PID1OUTHL_PID1OUT20_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT20_MASK                           0x10
#define _PID1OUTHL_PID1OUT21_POSN                           0x5
#define _PID1OUTHL_PID1OUT21_POSITION                       0x5
#define _PID1OUTHL_PID1OUT21_SIZE                           0x1
#define _PID1OUTHL_PID1OUT21_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT21_MASK                           0x20
#define _PID1OUTHL_PID1OUT22_POSN                           0x6
#define _PID1OUTHL_PID1OUT22_POSITION                       0x6
#define _PID1OUTHL_PID1OUT22_SIZE                           0x1
#define _PID1OUTHL_PID1OUT22_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT22_MASK                           0x40
#define _PID1OUTHL_PID1OUT23_POSN                           0x7
#define _PID1OUTHL_PID1OUT23_POSITION                       0x7
#define _PID1OUTHL_PID1OUT23_SIZE                           0x1
#define _PID1OUTHL_PID1OUT23_LENGTH                         0x1
#define _PID1OUTHL_PID1OUT23_MASK                           0x80
#define _PID1OUTHL_OUT16_POSN                               0x0
#define _PID1OUTHL_OUT16_POSITION                           0x0
#define _PID1OUTHL_OUT16_SIZE                               0x1
#define _PID1OUTHL_OUT16_LENGTH                             0x1
#define _PID1OUTHL_OUT16_MASK                               0x1
#define _PID1OUTHL_OUT17_POSN                               0x1
#define _PID1OUTHL_OUT17_POSITION                           0x1
#define _PID1OUTHL_OUT17_SIZE                               0x1
#define _PID1OUTHL_OUT17_LENGTH                             0x1
#define _PID1OUTHL_OUT17_MASK                               0x2
#define _PID1OUTHL_OUT18_POSN                               0x2
#define _PID1OUTHL_OUT18_POSITION                           0x2
#define _PID1OUTHL_OUT18_SIZE                               0x1
#define _PID1OUTHL_OUT18_LENGTH                             0x1
#define _PID1OUTHL_OUT18_MASK                               0x4
#define _PID1OUTHL_OUT19_POSN                               0x3
#define _PID1OUTHL_OUT19_POSITION                           0x3
#define _PID1OUTHL_OUT19_SIZE                               0x1
#define _PID1OUTHL_OUT19_LENGTH                             0x1
#define _PID1OUTHL_OUT19_MASK                               0x8
#define _PID1OUTHL_OUT20_POSN                               0x4
#define _PID1OUTHL_OUT20_POSITION                           0x4
#define _PID1OUTHL_OUT20_SIZE                               0x1
#define _PID1OUTHL_OUT20_LENGTH                             0x1
#define _PID1OUTHL_OUT20_MASK                               0x10
#define _PID1OUTHL_OUT21_POSN                               0x5
#define _PID1OUTHL_OUT21_POSITION                           0x5
#define _PID1OUTHL_OUT21_SIZE                               0x1
#define _PID1OUTHL_OUT21_LENGTH                             0x1
#define _PID1OUTHL_OUT21_MASK                               0x20
#define _PID1OUTHL_OUT22_POSN                               0x6
#define _PID1OUTHL_OUT22_POSITION                           0x6
#define _PID1OUTHL_OUT22_SIZE                               0x1
#define _PID1OUTHL_OUT22_LENGTH                             0x1
#define _PID1OUTHL_OUT22_MASK                               0x40
#define _PID1OUTHL_OUT23_POSN                               0x7
#define _PID1OUTHL_OUT23_POSITION                           0x7
#define _PID1OUTHL_OUT23_SIZE                               0x1
#define _PID1OUTHL_OUT23_LENGTH                             0x1
#define _PID1OUTHL_OUT23_MASK                               0x80

