MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
extern volatile PID1Z1Lbits_t PID1Z1Lbits __at(0x59B);
// bitfield macros
#define _PID1Z1L_PID1Z10_POSN                               0x0
#define _PID1Z1L_PID1Z10_POSITION                           0x0
#define _PID1Z1L_PID1Z10_SIZE                               0x1
#define _PID1Z1L_PID1Z10_LENGTH                             0x1
#define _PID1Z1L_PID1Z10_MASK                               0x1
#define _PID1Z1L_PID1Z11_POSN                               0x1
#define _PID1Z1L_PID1Z11_POSITION                           0x1
#define _PID1Z1L_PID1Z11_SIZE                               0x1
#define _PID1Z1L_PID1Z11_LENGTH                             0x1
#define _PID1Z1L_PID1Z11_MASK                               0x2
#define _PID1Z1L_PID1Z12_POSN                               0x2
#define _PID1Z1L_PID1Z12_POSITION                           0x2
#define _PID1Z1L_PID1Z12_SIZE                               0x1
#define _PID1Z1L_PID1Z12_LENGTH                             0x1
#define _PID1Z1L_PID1Z12_MASK                               0x4
#define _PID1Z1L_PID1Z13_POSN                               0x3
#define _PID1Z1L_PID1Z13_POSITION                           0x3
#define _PID1Z1L_PID1Z13_SIZE                               0x1
#define _PID1Z1L_PID1Z13_LENGTH                             0x1
#define _PID1Z1L_PID1Z13_MASK                               0x8
#define _PID1Z1L_PID1Z14_POSN                               0x4
#define _PID1Z1L_PID1Z14_POSITION                           0x4
#define _PID1Z1L_PID1Z14_SIZE                               0x1
#define _PID1Z1L_PID1Z14_LENGTH                             0x1
#define _PID1Z1L_PID1Z14_MASK                               0x10
#define _PID1Z1L_PID1Z15_POSN                               0x5
#define _PID1Z1L_PID1Z15_POSITION                           0x5
#define _PID1Z1L_PID1Z15_SIZE                               0x1
#define _PID1Z1L_PID1Z15_LENGTH                             0x1
#define _PID1Z1L_PID1Z15_MASK                               0x20
#define _PID1Z1L_PID1Z16_POSN                               0x6
#define _PID1Z1L_PID1Z16_POSITION                           0x6
#define _PID1Z1L_PID1Z16_SIZE                               0x1
#define _PID1Z1L_PID1Z16_LENGTH                             0x1
#define _PID1Z1L_PID1Z16_MASK                               0x40
#define _PID1Z1L_PID1Z17_POSN                               0x7
#define _PID1Z1L_PID1Z17_POSITION                           0x7
#define _PID1Z1L_PID1Z17_SIZE                               0x1
#define _PID1Z1L_PID1Z17_LENGTH                             0x1
#define _PID1Z1L_PID1Z17_MASK                               0x80
#define _PID1Z1L_Z10_POSN                                   0x0
#define _PID1Z1L_Z10_POSITION                               0x0
#define _PID1Z1L_Z10_SIZE                                   0x1
#define _PID1Z1L_Z10_LENGTH                                 0x1
#define _PID1Z1L_Z10_MASK                                   0x1
#define _PID1Z1L_Z11_POSN                                   0x1
#define _PID1Z1L_Z11_POSITION                               0x1
#define _PID1Z1L_Z11_SIZE                                   0x1
#define _PID1Z1L_Z11_LENGTH                                 0x1
#define _PID1Z1L_Z11_MASK                                   0x2
#define _PID1Z1L_Z12_POSN                                   0x2
#define _PID1Z1L_Z12_POSITION                               0x2
#define _PID1Z1L_Z12_SIZE                                   0x1
#define _PID1Z1L_Z12_LENGTH                                 0x1
#define _PID1Z1L_Z12_MASK                                   0x4
#define _PID1Z1L_Z13_POSN                                   0x3
#define _PID1Z1L_Z13_POSITION                               0x3
#define _PID1Z1L_Z13_SIZE                                   0x1
#define _PID1Z1L_Z13_LENGTH                                 0x1
#define _PID1Z1L_Z13_MASK                                   0x8
#define _PID1Z1L_Z14_POSN                                   0x4
#define _PID1Z1L_Z14_POSITION                               0x4
#define _PID1Z1L_Z14_SIZE                                   0x1
#define _PID1Z1L_Z14_LENGTH                                 0x1
#define _PID1Z1L_Z14_MASK                                   0x10
#define _PID1Z1L_Z15_POSN                                   0x5
#define _PID1Z1L_Z15_POSITION                               0x5
#define _PID1Z1L_Z15_SIZE                                   0x1
#define _PID1Z1L_Z15_LENGTH                                 0x1
#define _PID1Z1L_Z15_MASK                                   0x20
#define _PID1Z1L_Z16_POSN                                   0x6
#define _PID1Z1L_Z16_POSITION                               0x6
#define _PID1Z1L_Z16_SIZE                                   0x1
#define _PID1Z1L_Z16_LENGTH                                 0x1
#define _PID1Z1L_Z16_MASK                                   0x40
#define _PID1Z1L_Z17_POSN                                   0x7
#define _PID1Z1L_Z17_POSITION                               0x7
#define _PID1Z1L_Z17_SIZE                                   0x1
#define _PID1Z1L_Z17_LENGTH                                 0x1
#define _PID1Z1L_Z17_MASK                                   0x80

// Register: PID1Z1H
#define PID1Z1H PID1Z1H
extern volatile unsigned char           PID1Z1H             __at(0x59C);
#ifndef _LIB_BUILD
asm("PID1Z1H equ 059Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1Z18                :1;
        unsigned PID1Z19                :1;
        unsigned PID1Z110               :1;
        unsigned PID1Z111               :1;
        unsigned PID1Z112               :1;
        unsigned PID1Z113               :1;
        unsigned PID1Z114               :1;
        unsigned PID1Z115               :1;
    };
    struct {
        unsigned Z18                    :1;
        unsigned Z19                    :1;
        unsigned Z110                   :1;
        unsigned Z111                   :1;
        unsigned Z112                   :1;
        unsigned Z113                   :1;
        unsigned Z114                   :1;
        unsigned Z115                   :1;
    };
} PID1Z1Hbits_t;
extern volatile PID1Z1Hbits_t PID1Z1Hbits __at(0x59C);
// bitfield macros
#define _PID1Z1H_PID1Z18_POSN                               0x0
#define _PID1Z1H_PID1Z18_POSITION                           0x0
#define _PID1Z1H_PID1Z18_SIZE                               0x1
#define _PID1Z1H_PID1Z18_LENGTH                             0x1
#define _PID1Z1H_PID1Z18_MASK                               0x1
#define _PID1Z1H_PID1Z19_POSN                               0x1
#define _PID1Z1H_PID1Z19_POSITION                           0x1
#define _PID1Z1H_PID1Z19_SIZE                               0x1
#define _PID1Z1H_PID1Z19_LENGTH                             0x1
#define _PID1Z1H_PID1Z19_MASK                               0x2
#define _PID1Z1H_PID1Z110_POSN                              0x2
#define _PID1Z1H_PID1Z110_POSITION                          0x2
#define _PID1Z1H_PID1Z110_SIZE                              0x1
#define _PID1Z1H_PID1Z110_LENGTH                            0x1
#define _PID1Z1H_PID1Z110_MASK                              0x4
#define _PID1Z1H_PID1Z111_POSN                              0x3
#define _PID1Z1H_PID1Z111_POSITION                          0x3
#define _PID1Z1H_PID1Z111_SIZE                              0x1
#define _PID1Z1H_PID1Z111_LENGTH                            0x1
#define _PID1Z1H_PID1Z111_MASK                              0x8
#define _PID1Z1H_PID1Z112_POSN                              0x4
#define _PID1Z1H_PID1Z112_POSITION                          0x4
#define _PID1Z1H_PID1Z112_SIZE                              0x1
#define _PID1Z1H_PID1Z112_LENGTH                            0x1
#define _PID1Z1H_PID1Z112_MASK                              0x10
#define _PID1Z1H_PID1Z113_POSN                              0x5
#define _PID1Z1H_PID1Z113_POSITION                          0x5
#define _PID1Z1H_PID1Z113_SIZE                              0x1
#define _PID1Z1H_PID1Z113_LENGTH                            0x1
#define _PID1Z1H_PID1Z113_MASK                              0x20
#define _PID1Z1H_PID1Z114_POSN                              0x6
#define _PID1Z1H_PID1Z114_POSITION                          0x6
#define _PID1Z1H_PID1Z114_SIZE                              0x1
#define _PID1Z1H_PID1Z114_LENGTH                            0x1
#define _PID1Z1H_PID1Z114_MASK                              0x40
#define _PID1Z1H_PID1Z115_POSN                              0x7
#define _PID1Z1H_PID1Z115_POSITION                          0x7
#define _PID1Z1H_PID1Z115_SIZE                              0x1
#define _PID1Z1H_PID1Z115_LENGTH                            0x1
#define _PID1Z1H_PID1Z115_MASK                              0x80
#define _PID1Z1H_Z18_POSN                                   0x0
#define _PID1Z1H_Z18_POSITION                               0x0
#define _PID1Z1H_Z18_SIZE                                   0x1
#define _PID1Z1H_Z18_LENGTH                                 0x1
#define _PID1Z1H_Z18_MASK                                   0x1
#define _PID1Z1H_Z19_POSN                                   0x1
#define _PID1Z1H_Z19_POSITION                               0x1
#define _PID1Z1H_Z19_SIZE                                   0x1
#define _PID1Z1H_Z19_LENGTH                                 0x1
#define _PID1Z1H_Z19_MASK                                   0x2
#define _PID1Z1H_Z110_POSN                                  0x2
#define _PID1Z1H_Z110_POSITION                              0x2
#define _PID1Z1H_Z110_SIZE                                  0x1
#define _PID1Z1H_Z110_LENGTH                                0x1
#define _PID1Z1H_Z110_MASK                                  0x4
#define _PID1Z1H_Z111_POSN                                  0x3
#define _PID1Z1H_Z111_POSITION                              0x3
#define _PID1Z1H_Z111_SIZE                                  0x1
#define _PID1Z1H_Z111_LENGTH                                0x1
#define _PID1Z1H_Z111_MASK                                  0x8
#define _PID1Z1H_Z112_POSN                                  0x4
#define _PID1Z1H_Z112_POSITION                              0x4
#define _PID1Z1H_Z112_SIZE                                  0x1
#define _PID1Z1H_Z112_LENGTH                                0x1
#define _PID1Z1H_Z112_MASK                                  0x10
#define _PID1Z1H_Z113_POSN                                  0x5
#define _PID1Z1H_Z113_POSITION                              0x5
#define _PID1Z1H_Z113_SIZE                                  0x1
#define _PID1Z1H_Z113_LENGTH                                0x1
#define _PID1Z1H_Z113_MASK                                  0x20
#define _PID1Z1H_Z114_POSN                                  0x6
#define _PID1Z1H_Z114_POSITION                              0x6
#define _PID1Z1H_Z114_SIZE                                  0x1
#define _PID1Z1H_Z114_LENGTH                                0x1
#define _PID1Z1H_Z114_MASK                                  0x40
#define _PID1Z1H_Z115_POSN                                  0x7
#define _PID1Z1H_Z115_POSITION                              0x7
#define _PID1Z1H_Z115_SIZE                                  0x1
#define _PID1Z1H_Z115_LENGTH                                0x1
#define _PID1Z1H_Z115_MASK                                  0x80

// Register: PID1Z1U
#define PID1Z1U PID1Z1U
extern volatile unsigned char           PID1Z1U             __at(0x59D);
#ifndef _LIB_BUILD
asm("PID1Z1U equ 059Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1Z116               :1;
    };
    struct {
        unsigned Z116                   :1;
    };
} PID1Z1Ubits_t;
