MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
// Register: AT1PERL
#define AT1PERL AT1PERL
extern volatile unsigned char           AT1PERL             __at(0x810);
#ifndef _LIB_BUILD
asm("AT1PERL equ 0810h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1PER0                :1;
        unsigned AT1PER1                :1;
        unsigned AT1PER2                :1;
        unsigned AT1PER3                :1;
        unsigned AT1PER4                :1;
        unsigned AT1PER5                :1;
        unsigned AT1PER6                :1;
        unsigned AT1PER7                :1;
    };
    struct {
        unsigned PER0                   :1;
        unsigned PER1                   :1;
        unsigned PER2                   :1;
        unsigned PER3                   :1;
        unsigned PER4                   :1;
        unsigned PER5                   :1;
        unsigned PER6                   :1;
        unsigned PER7                   :1;
    };
    struct {
        unsigned PERL0                  :1;
        unsigned PERL1                  :1;
        unsigned PERL2                  :1;
        unsigned PERL3                  :1;
        unsigned PERL4                  :1;
        unsigned PERL5                  :1;
        unsigned PERL6                  :1;
        unsigned PERL7                  :1;
    };
} AT1PERLbits_t;
extern volatile AT1PERLbits_t AT1PERLbits __at(0x810);
// bitfield macros
#define _AT1PERL_AT1PER0_POSN                               0x0
#define _AT1PERL_AT1PER0_POSITION                           0x0
#define _AT1PERL_AT1PER0_SIZE                               0x1
#define _AT1PERL_AT1PER0_LENGTH                             0x1
#define _AT1PERL_AT1PER0_MASK                               0x1
#define _AT1PERL_AT1PER1_POSN                               0x1
#define _AT1PERL_AT1PER1_POSITION                           0x1
#define _AT1PERL_AT1PER1_SIZE                               0x1
#define _AT1PERL_AT1PER1_LENGTH                             0x1
#define _AT1PERL_AT1PER1_MASK                               0x2
#define _AT1PERL_AT1PER2_POSN                               0x2
#define _AT1PERL_AT1PER2_POSITION                           0x2
#define _AT1PERL_AT1PER2_SIZE                               0x1
#define _AT1PERL_AT1PER2_LENGTH                             0x1
#define _AT1PERL_AT1PER2_MASK                               0x4
#define _AT1PERL_AT1PER3_POSN                               0x3
#define _AT1PERL_AT1PER3_POSITION                           0x3
#define _AT1PERL_AT1PER3_SIZE                               0x1
#define _AT1PERL_AT1PER3_LENGTH                             0x1
#define _AT1PERL_AT1PER3_MASK                               0x8
#define _AT1PERL_AT1PER4_POSN                               0x4
#define _AT1PERL_AT1PER4_POSITION                           0x4
#define _AT1PERL_AT1PER4_SIZE                               0x1
#define _AT1PERL_AT1PER4_LENGTH                             0x1
#define _AT1PERL_AT1PER4_MASK                               0x10
#define _AT1PERL_AT1PER5_POSN                               0x5
#define _AT1PERL_AT1PER5_POSITION                           0x5
#define _AT1PERL_AT1PER5_SIZE                               0x1
#define _AT1PERL_AT1PER5_LENGTH                             0x1
#define _AT1PERL_AT1PER5_MASK                               0x20
#define _AT1PERL_AT1PER6_POSN                               0x6
#define _AT1PERL_AT1PER6_POSITION                           0x6
#define _AT1PERL_AT1PER6_SIZE                               0x1
#define _AT1PERL_AT1PER6_LENGTH                             0x1
#define _AT1PERL_AT1PER6_MASK                               0x40
#define _AT1PERL_AT1PER7_POSN                               0x7
#define _AT1PERL_AT1PER7_POSITION                           0x7
#define _AT1PERL_AT1PER7_SIZE                               0x1
#define _AT1PERL_AT1PER7_LENGTH                             0x1
#define _AT1PERL_AT1PER7_MASK                               0x80
#define _AT1PERL_PER0_POSN                                  0x0
#define _AT1PERL_PER0_POSITION                              0x0
#define _AT1PERL_PER0_SIZE                                  0x1
#define _AT1PERL_PER0_LENGTH                                0x1
#define _AT1PERL_PER0_MASK                                  0x1
#define _AT1PERL_PER1_POSN                                  0x1
#define _AT1PERL_PER1_POSITION                              0x1
#define _AT1PERL_PER1_SIZE                                  0x1
#define _AT1PERL_PER1_LENGTH                                0x1
#define _AT1PERL_PER1_MASK                                  0x2
#define _AT1PERL_PER2_POSN                                  0x2
#define _AT1PERL_PER2_POSITION                              0x2
#define _AT1PERL_PER2_SIZE                                  0x1
#define _AT1PERL_PER2_LENGTH                                0x1
#define _AT1PERL_PER2_MASK                                  0x4
#define _AT1PERL_PER3_POSN                                  0x3
#define _AT1PERL_PER3_POSITION                              0x3
#define _AT1PERL_PER3_SIZE                                  0x1
#define _AT1PERL_PER3_LENGTH                                0x1
#define _AT1PERL_PER3_MASK                                  0x8
#define _AT1PERL_PER4_POSN                                  0x4
#define _AT1PERL_PER4_POSITION                              0x4
#define _AT1PERL_PER4_SIZE                                  0x1
#define _AT1PERL_PER4_LENGTH                                0x1
#define _AT1PERL_PER4_MASK                                  0x10
#define _AT1PERL_PER5_POSN                                  0x5
#define _AT1PERL_PER5_POSITION                              0x5
#define _AT1PERL_PER5_SIZE                                  0x1
#define _AT1PERL_PER5_LENGTH                                0x1
#define _AT1PERL_PER5_MASK                                  0x20
#define _AT1PERL_PER6_POSN                                  0x6
#define _AT1PERL_PER6_POSITION                              0x6
#define _AT1PERL_PER6_SIZE                                  0x1
#define _AT1PERL_PER6_LENGTH                                0x1
#define _AT1PERL_PER6_MASK                                  0x40
#define _AT1PERL_PER7_POSN                                  0x7
#define _AT1PERL_PER7_POSITION                              0x7
#define _AT1PERL_PER7_SIZE                                  0x1
#define _AT1PERL_PER7_LENGTH                                0x1
#define _AT1PERL_PER7_MASK                                  0x80
#define _AT1PERL_PERL0_POSN                                 0x0
#define _AT1PERL_PERL0_POSITION                             0x0
#define _AT1PERL_PERL0_SIZE                                 0x1
#define _AT1PERL_PERL0_LENGTH                               0x1
#define _AT1PERL_PERL0_MASK                                 0x1
#define _AT1PERL_PERL1_POSN                                 0x1
#define _AT1PERL_PERL1_POSITION                             0x1
#define _AT1PERL_PERL1_SIZE                                 0x1
#define _AT1PERL_PERL1_LENGTH                               0x1
#define _AT1PERL_PERL1_MASK                                 0x2
#define _AT1PERL_PERL2_POSN                                 0x2
#define _AT1PERL_PERL2_POSITION                             0x2
#define _AT1PERL_PERL2_SIZE                                 0x1
#define _AT1PERL_PERL2_LENGTH                               0x1
#define _AT1PERL_PERL2_MASK                                 0x4
#define _AT1PERL_PERL3_POSN                                 0x3
#define _AT1PERL_PERL3_POSITION                             0x3
#define _AT1PERL_PERL3_SIZE                                 0x1
#define _AT1PERL_PERL3_LENGTH                               0x1
#define _AT1PERL_PERL3_MASK                                 0x8
#define _AT1PERL_PERL4_POSN                                 0x4
#define _AT1PERL_PERL4_POSITION                             0x4
#define _AT1PERL_PERL4_SIZE                                 0x1
#define _AT1PERL_PERL4_LENGTH                               0x1
#define _AT1PERL_PERL4_MASK                                 0x10
#define _AT1PERL_PERL5_POSN                                 0x5
#define _AT1PERL_PERL5_POSITION                             0x5
#define _AT1PERL_PERL5_SIZE                                 0x1
#define _AT1PERL_PERL5_LENGTH                               0x1
#define _AT1PERL_PERL5_MASK                                 0x20
#define _AT1PERL_PERL6_POSN                                 0x6
#define _AT1PERL_PERL6_POSITION                             0x6
#define _AT1PERL_PERL6_SIZE                                 0x1
#define _AT1PERL_PERL6_LENGTH                               0x1
#define _AT1PERL_PERL6_MASK                                 0x40
#define _AT1PERL_PERL7_POSN                                 0x7
#define _AT1PERL_PERL7_POSITION                             0x7
#define _AT1PERL_PERL7_SIZE                                 0x1
#define _AT1PERL_PERL7_LENGTH                               0x1
#define _AT1PERL_PERL7_MASK                                 0x80

// Register: AT1PERH
#define AT1PERH AT1PERH
extern volatile unsigned char           AT1PERH             __at(0x811);
#ifndef _LIB_BUILD
asm("AT1PERH equ 0811h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1PER8                :1;
        unsigned AT1PER9                :1;
        unsigned AT1PER10               :1;
        unsigned AT1PER11               :1;
        unsigned AT1PER12               :1;
        unsigned AT1PER13               :1;
        unsigned AT1PER14               :1;
        unsigned AT1POV                 :1;
    };
    struct {
        unsigned PER8                   :1;
        unsigned PER9                   :1;
        unsigned PER10                  :1;
        unsigned PER11                  :1;
        unsigned PER12                  :1;
        unsigned PER13                  :1;
        unsigned PER14                  :1;
        unsigned PER15                  :1;
    };
    struct {
        unsigned PERH0                  :1;
        unsigned PERH1                  :1;
        unsigned PERH2                  :1;
        unsigned PERH3                  :1;
        unsigned PERH4                  :1;
        unsigned PERH5                  :1;
        unsigned PERH6                  :1;
        unsigned PERH7                  :1;
    };
} AT1PERHbits_t;
extern volatile AT1PERHbits_t AT1PERHbits __at(0x811);
// bitfield macros
#define _AT1PERH_AT1PER8_POSN                               0x0
#define _AT1PERH_AT1PER8_POSITION                           0x0
#define _AT1PERH_AT1PER8_SIZE                               0x1
#define _AT1PERH_AT1PER8_LENGTH                             0x1
#define _AT1PERH_AT1PER8_MASK                               0x1
#define _AT1PERH_AT1PER9_POSN                               0x1
#define _AT1PERH_AT1PER9_POSITION                           0x1
#define _AT1PERH_AT1PER9_SIZE                               0x1
#define _AT1PERH_AT1PER9_LENGTH                             0x1
#define _AT1PERH_AT1PER9_MASK                               0x2
#define _AT1PERH_AT1PER10_POSN                              0x2
#define _AT1PERH_AT1PER10_POSITION                          0x2
#define _AT1PERH_AT1PER10_SIZE                              0x1
#define _AT1PERH_AT1PER10_LENGTH                            0x1
#define _AT1PERH_AT1PER10_MASK                              0x4
#define _AT1PERH_AT1PER11_POSN                              0x3
#define _AT1PERH_AT1PER11_POSITION                          0x3
#define _AT1PERH_AT1PER11_SIZE                              0x1
#define _AT1PERH_AT1PER11_LENGTH                            0x1
#define _AT1PERH_AT1PER11_MASK                              0x8
#define _AT1PERH_AT1PER12_POSN                              0x4
#define _AT1PERH_AT1PER12_POSITION                          0x4
#define _AT1PERH_AT1PER12_SIZE                              0x1
#define _AT1PERH_AT1PER12_LENGTH                            0x1
#define _AT1PERH_AT1PER12_MASK                              0x10
#define _AT1PERH_AT1PER13_POSN                              0x5
#define _AT1PERH_AT1PER13_POSITION                          0x5
#define _AT1PERH_AT1PER13_SIZE                              0x1
#define _AT1PERH_AT1PER13_LENGTH                            0x1
#define _AT1PERH_AT1PER13_MASK                              0x20
#define _AT1PERH_AT1PER14_POSN                              0x6
#define _AT1PERH_AT1PER14_POSITION                          0x6
#define _AT1PERH_AT1PER14_SIZE                              0x1
#define _AT1PERH_AT1PER14_LENGTH                            0x1
#define _AT1PERH_AT1PER14_MASK                              0x40
#define _AT1PERH_AT1POV_POSN                                0x7
#define _AT1PERH_AT1POV_POSITION                            0x7
#define _AT1PERH_AT1POV_SIZE                                0x1
#define _AT1PERH_AT1POV_LENGTH                              0x1
#define _AT1PERH_AT1POV_MASK                                0x80
#define _AT1PERH_PER8_POSN                                  0x0
#define _AT1PERH_PER8_POSITION                              0x0
#define _AT1PERH_PER8_SIZE                                  0x1
#define _AT1PERH_PER8_LENGTH                                0x1
#define _AT1PERH_PER8_MASK                                  0x1
#define _AT1PERH_PER9_POSN                                  0x1
#define _AT1PERH_PER9_POSITION                              0x1
#define _AT1PERH_PER9_SIZE                                  0x1
#define _AT1PERH_PER9_LENGTH                                0x1
#define _AT1PERH_PER9_MASK                                  0x2
#define _AT1PERH_PER10_POSN                                 0x2
#define _AT1PERH_PER10_POSITION                             0x2
#define _AT1PERH_PER10_SIZE                                 0x1
#define _AT1PERH_PER10_LENGTH                               0x1
#define _AT1PERH_PER10_MASK                                 0x4
#define _AT1PERH_PER11_POSN                                 0x3
#define _AT1PERH_PER11_POSITION                             0x3
#define _AT1PERH_PER11_SIZE                                 0x1
#define _AT1PERH_PER11_LENGTH                               0x1
#define _AT1PERH_PER11_MASK                                 0x8
#define _AT1PERH_PER12_POSN                                 0x4
#define _AT1PERH_PER12_POSITION                             0x4
#define _AT1PERH_PER12_SIZE                                 0x1
#define _AT1PERH_PER12_LENGTH                               0x1
#define _AT1PERH_PER12_MASK                                 0x10
#define _AT1PERH_PER13_POSN                                 0x5
#define _AT1PERH_PER13_POSITION                             0x5
#define _AT1PERH_PER13_SIZE                                 0x1
#define _AT1PERH_PER13_LENGTH                               0x1
#define _AT1PERH_PER13_MASK                                 0x20
#define _AT1PERH_PER14_POSN                                 0x6
#define _AT1PERH_PER14_POSITION                             0x6
#define _AT1PERH_PER14_SIZE                                 0x1
#define _AT1PERH_PER14_LENGTH                               0x1
#define _AT1PERH_PER14_MASK                                 0x40
#define _AT1PERH_PER15_POSN                                 0x7
#define _AT1PERH_PER15_POSITION                             0x7
#define _AT1PERH_PER15_SIZE                                 0x1
#define _AT1PERH_PER15_LENGTH                               0x1
#define _AT1PERH_PER15_MASK                                 0x80
#define _AT1PERH_PERH0_POSN                                 0x0
#define _AT1PERH_PERH0_POSITION                             0x0
#define _AT1PERH_PERH0_SIZE                                 0x1
#define _AT1PERH_PERH0_LENGTH                               0x1
#define _AT1PERH_PERH0_MASK                                 0x1
#define _AT1PERH_PERH1_POSN                                 0x1
#define _AT1PERH_PERH1_POSITION                             0x1
#define _AT1PERH_PERH1_SIZE                                 0x1
#define _AT1PERH_PERH1_LENGTH                               0x1
#define _AT1PERH_PERH1_MASK                                 0x2
#define _AT1PERH_PERH2_POSN                                 0x2
#define _AT1PERH_PERH2_POSITION                             0x2
#define _AT1PERH_PERH2_SIZE                                 0x1
#define _AT1PERH_PERH2_LENGTH                               0x1
#define _AT1PERH_PERH2_MASK                                 0x4
#define _AT1PERH_PERH3_POSN                                 0x3
#define _AT1PERH_PERH3_POSITION                             0x3
#define _AT1PERH_PERH3_SIZE                                 0x1
#define _AT1PERH_PERH3_LENGTH                               0x1
#define _AT1PERH_PERH3_MASK                                 0x8
#define _AT1PERH_PERH4_POSN                                 0x4
#define _AT1PERH_PERH4_POSITION                             0x4
#define _AT1PERH_PERH4_SIZE                                 0x1
#define _AT1PERH_PERH4_LENGTH                               0x1
#define _AT1PERH_PERH4_MASK                                 0x10
#define _AT1PERH_PERH5_POSN                                 0x5
#define _AT1PERH_PERH5_POSITION                             0x5
#define _AT1PERH_PERH5_SIZE                                 0x1
#define _AT1PERH_PERH5_LENGTH                               0x1
#define _AT1PERH_PERH5_MASK                                 0x20
#define _AT1PERH_PERH6_POSN                                 0x6
#define _AT1PERH_PERH6_POSITION                             0x6
#define _AT1PERH_PERH6_SIZE                                 0x1
#define _AT1PERH_PERH6_LENGTH                               0x1
#define _AT1PERH_PERH6_MASK                                 0x40
#define _AT1PERH_PERH7_POSN                                 0x7
#define _AT1PERH_PERH7_POSITION                             0x7
#define _AT1PERH_PERH7_SIZE                                 0x1
#define _AT1PERH_PERH7_LENGTH                               0x1
#define _AT1PERH_PERH7_MASK                                 0x80

// Register: AT1PHS
#define AT1PHS AT1PHS
extern volatile unsigned short          AT1PHS              __at(0x812);
#ifndef _LIB_BUILD
asm("AT1PHS equ 0812h");
#endif

// Register: AT1PHSL
#define AT1PHSL AT1PHSL
extern volatile unsigned char           AT1PHSL             __at(0x812);
#ifndef _LIB_BUILD
asm("AT1PHSL equ 0812h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1PHS0                :1;
        unsigned AT1PHS1                :1;
        unsigned AT1PHS2                :1;
        unsigned AT1PHS3                :1;
        unsigned AT1PHS4                :1;
        unsigned AT1PHS5                :1;
        unsigned AT1PHS6                :1;
        unsigned AT1PHS7                :1;
    };
    struct {
        unsigned PHS0                   :1;
        unsigned PHS1                   :1;
        unsigned PHS2                   :1;
        unsigned PHS3                   :1;
        unsigned PHS4                   :1;
        unsigned PHS5                   :1;
        unsigned PHS6                   :1;
        unsigned PHS7                   :1;
    };
} AT1PHSLbits_t;
