MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
// Register: AT1CC3H
#define AT1CC3H AT1CC3H
extern volatile unsigned char           AT1CC3H             __at(0x898);
#ifndef _LIB_BUILD
asm("AT1CC3H equ 0898h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC38                :1;
        unsigned AT1CC39                :1;
    };
    struct {
        unsigned CC38                   :1;
        unsigned CC39                   :1;
    };
} AT1CC3Hbits_t;
extern volatile AT1CC3Hbits_t AT1CC3Hbits __at(0x898);
// bitfield macros
#define _AT1CC3H_AT1CC38_POSN                               0x0
#define _AT1CC3H_AT1CC38_POSITION                           0x0
#define _AT1CC3H_AT1CC38_SIZE                               0x1
#define _AT1CC3H_AT1CC38_LENGTH                             0x1
#define _AT1CC3H_AT1CC38_MASK                               0x1
#define _AT1CC3H_AT1CC39_POSN                               0x1
#define _AT1CC3H_AT1CC39_POSITION                           0x1
#define _AT1CC3H_AT1CC39_SIZE                               0x1
#define _AT1CC3H_AT1CC39_LENGTH                             0x1
#define _AT1CC3H_AT1CC39_MASK                               0x2
#define _AT1CC3H_CC38_POSN                                  0x0
#define _AT1CC3H_CC38_POSITION                              0x0
#define _AT1CC3H_CC38_SIZE                                  0x1
#define _AT1CC3H_CC38_LENGTH                                0x1
#define _AT1CC3H_CC38_MASK                                  0x1
#define _AT1CC3H_CC39_POSN                                  0x1
#define _AT1CC3H_CC39_POSITION                              0x1
#define _AT1CC3H_CC39_SIZE                                  0x1
#define _AT1CC3H_CC39_LENGTH                                0x1
#define _AT1CC3H_CC39_MASK                                  0x2

// Register: AT1CCON3
#define AT1CCON3 AT1CCON3
extern volatile unsigned char           AT1CCON3            __at(0x899);
#ifndef _LIB_BUILD
asm("AT1CCON3 equ 0899h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC3MODE             :1;
        unsigned                        :2;
        unsigned AT1CAP3P               :1;
        unsigned AT1CC3POL              :1;
        unsigned                        :2;
        unsigned AT1CC3EN               :1;
    };
    struct {
        unsigned CC3MODE                :1;
        unsigned                        :2;
        unsigned CAP3P                  :1;
        unsigned CC3POL                 :1;
        unsigned                        :2;
        unsigned CC3EN                  :1;
    };
} AT1CCON3bits_t;
extern volatile AT1CCON3bits_t AT1CCON3bits __at(0x899);
// bitfield macros
#define _AT1CCON3_AT1CC3MODE_POSN                           0x0
#define _AT1CCON3_AT1CC3MODE_POSITION                       0x0
#define _AT1CCON3_AT1CC3MODE_SIZE                           0x1
#define _AT1CCON3_AT1CC3MODE_LENGTH                         0x1
#define _AT1CCON3_AT1CC3MODE_MASK                           0x1
#define _AT1CCON3_AT1CAP3P_POSN                             0x3
#define _AT1CCON3_AT1CAP3P_POSITION                         0x3
#define _AT1CCON3_AT1CAP3P_SIZE                             0x1
#define _AT1CCON3_AT1CAP3P_LENGTH                           0x1
#define _AT1CCON3_AT1CAP3P_MASK                             0x8
#define _AT1CCON3_AT1CC3POL_POSN                            0x4
#define _AT1CCON3_AT1CC3POL_POSITION                        0x4
#define _AT1CCON3_AT1CC3POL_SIZE                            0x1
#define _AT1CCON3_AT1CC3POL_LENGTH                          0x1
#define _AT1CCON3_AT1CC3POL_MASK                            0x10
#define _AT1CCON3_AT1CC3EN_POSN                             0x7
#define _AT1CCON3_AT1CC3EN_POSITION                         0x7
#define _AT1CCON3_AT1CC3EN_SIZE                             0x1
#define _AT1CCON3_AT1CC3EN_LENGTH                           0x1
#define _AT1CCON3_AT1CC3EN_MASK                             0x80
#define _AT1CCON3_CC3MODE_POSN                              0x0
#define _AT1CCON3_CC3MODE_POSITION                          0x0
#define _AT1CCON3_CC3MODE_SIZE                              0x1
#define _AT1CCON3_CC3MODE_LENGTH                            0x1
#define _AT1CCON3_CC3MODE_MASK                              0x1
#define _AT1CCON3_CAP3P_POSN                                0x3
#define _AT1CCON3_CAP3P_POSITION                            0x3
#define _AT1CCON3_CAP3P_SIZE                                0x1
#define _AT1CCON3_CAP3P_LENGTH                              0x1
#define _AT1CCON3_CAP3P_MASK                                0x8
#define _AT1CCON3_CC3POL_POSN                               0x4
#define _AT1CCON3_CC3POL_POSITION                           0x4
#define _AT1CCON3_CC3POL_SIZE                               0x1
#define _AT1CCON3_CC3POL_LENGTH                             0x1
#define _AT1CCON3_CC3POL_MASK                               0x10
#define _AT1CCON3_CC3EN_POSN                                0x7
#define _AT1CCON3_CC3EN_POSITION                            0x7
#define _AT1CCON3_CC3EN_SIZE                                0x1
#define _AT1CCON3_CC3EN_LENGTH                              0x1
#define _AT1CCON3_CC3EN_MASK                                0x80

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
#ifndef __CCI__
extern volatile __uint24                SMT1TMR             __at(0xD8C);
#endif
#ifndef _LIB_BUILD
asm("SMT1TMR equ 0D8Ch");
#endif

// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
extern volatile unsigned char           SMT1TMRL            __at(0xD8C);
#ifndef _LIB_BUILD
asm("SMT1TMRL equ 0D8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR0               :1;
        unsigned SMT1TMR1               :1;
        unsigned SMT1TMR2               :1;
        unsigned SMT1TMR3               :1;
        unsigned SMT1TMR4               :1;
        unsigned SMT1TMR5               :1;
        unsigned SMT1TMR6               :1;
        unsigned SMT1TMR7               :1;
    };
} SMT1TMRLbits_t;
