MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
// Register: SMT2CON1
#define SMT2CON1 SMT2CON1
extern volatile unsigned char           SMT2CON1            __at(0xDAB);
#ifndef _LIB_BUILD
asm("SMT2CON1 equ 0DABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned                        :2;
        unsigned REPEAT                 :1;
        unsigned SMT2GO                 :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned SMT2MODE               :4;
        unsigned                        :2;
        unsigned SMT2REPEAT             :1;
    };
    struct {
        unsigned SMT2MODE0              :1;
        unsigned SMT2MODE1              :1;
        unsigned SMT2MODE2              :1;
        unsigned SMT2MODE3              :1;
    };
} SMT2CON1bits_t;
extern volatile SMT2CON1bits_t SMT2CON1bits __at(0xDAB);
// bitfield macros
#define _SMT2CON1_MODE_POSN                                 0x0
#define _SMT2CON1_MODE_POSITION                             0x0
#define _SMT2CON1_MODE_SIZE                                 0x4
#define _SMT2CON1_MODE_LENGTH                               0x4
#define _SMT2CON1_MODE_MASK                                 0xF
#define _SMT2CON1_REPEAT_POSN                               0x6
#define _SMT2CON1_REPEAT_POSITION                           0x6
#define _SMT2CON1_REPEAT_SIZE                               0x1
#define _SMT2CON1_REPEAT_LENGTH                             0x1
#define _SMT2CON1_REPEAT_MASK                               0x40
#define _SMT2CON1_SMT2GO_POSN                               0x7
#define _SMT2CON1_SMT2GO_POSITION                           0x7
#define _SMT2CON1_SMT2GO_SIZE                               0x1
#define _SMT2CON1_SMT2GO_LENGTH                             0x1
#define _SMT2CON1_SMT2GO_MASK                               0x80
#define _SMT2CON1_MODE0_POSN                                0x0
#define _SMT2CON1_MODE0_POSITION                            0x0
#define _SMT2CON1_MODE0_SIZE                                0x1
#define _SMT2CON1_MODE0_LENGTH                              0x1
#define _SMT2CON1_MODE0_MASK                                0x1
#define _SMT2CON1_MODE1_POSN                                0x1
#define _SMT2CON1_MODE1_POSITION                            0x1
#define _SMT2CON1_MODE1_SIZE                                0x1
#define _SMT2CON1_MODE1_LENGTH                              0x1
#define _SMT2CON1_MODE1_MASK                                0x2
#define _SMT2CON1_MODE2_POSN                                0x2
#define _SMT2CON1_MODE2_POSITION                            0x2
#define _SMT2CON1_MODE2_SIZE                                0x1
#define _SMT2CON1_MODE2_LENGTH                              0x1
#define _SMT2CON1_MODE2_MASK                                0x4
#define _SMT2CON1_MODE3_POSN                                0x3
#define _SMT2CON1_MODE3_POSITION                            0x3
#define _SMT2CON1_MODE3_SIZE                                0x1
#define _SMT2CON1_MODE3_LENGTH                              0x1
#define _SMT2CON1_MODE3_MASK                                0x8
#define _SMT2CON1_SMT2MODE_POSN                             0x0
#define _SMT2CON1_SMT2MODE_POSITION                         0x0
#define _SMT2CON1_SMT2MODE_SIZE                             0x4
#define _SMT2CON1_SMT2MODE_LENGTH                           0x4
#define _SMT2CON1_SMT2MODE_MASK                             0xF
#define _SMT2CON1_SMT2REPEAT_POSN                           0x6
#define _SMT2CON1_SMT2REPEAT_POSITION                       0x6
#define _SMT2CON1_SMT2REPEAT_SIZE                           0x1
#define _SMT2CON1_SMT2REPEAT_LENGTH                         0x1
#define _SMT2CON1_SMT2REPEAT_MASK                           0x40
#define _SMT2CON1_SMT2MODE0_POSN                            0x0
#define _SMT2CON1_SMT2MODE0_POSITION                        0x0
#define _SMT2CON1_SMT2MODE0_SIZE                            0x1
#define _SMT2CON1_SMT2MODE0_LENGTH                          0x1
#define _SMT2CON1_SMT2MODE0_MASK                            0x1
#define _SMT2CON1_SMT2MODE1_POSN                            0x1
#define _SMT2CON1_SMT2MODE1_POSITION                        0x1
#define _SMT2CON1_SMT2MODE1_SIZE                            0x1
#define _SMT2CON1_SMT2MODE1_LENGTH                          0x1
#define _SMT2CON1_SMT2MODE1_MASK                            0x2
#define _SMT2CON1_SMT2MODE2_POSN                            0x2
#define _SMT2CON1_SMT2MODE2_POSITION                        0x2
#define _SMT2CON1_SMT2MODE2_SIZE                            0x1
#define _SMT2CON1_SMT2MODE2_LENGTH                          0x1
#define _SMT2CON1_SMT2MODE2_MASK                            0x4
#define _SMT2CON1_SMT2MODE3_POSN                            0x3
#define _SMT2CON1_SMT2MODE3_POSITION                        0x3
#define _SMT2CON1_SMT2MODE3_SIZE                            0x1
#define _SMT2CON1_SMT2MODE3_LENGTH                          0x1
#define _SMT2CON1_SMT2MODE3_MASK                            0x8

// Register: SMT2STAT
#define SMT2STAT SMT2STAT
extern volatile unsigned char           SMT2STAT            __at(0xDAC);
#ifndef _LIB_BUILD
asm("SMT2STAT equ 0DACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS                     :1;
        unsigned WS                     :1;
        unsigned TS                     :1;
        unsigned                        :2;
        unsigned RST                    :1;
        unsigned CPWUP                  :1;
        unsigned CPRUP                  :1;
    };
    struct {
        unsigned SMT2AS                 :1;
        unsigned SMT2WS                 :1;
        unsigned SMT2TS                 :1;
        unsigned                        :2;
        unsigned SMT2RESET              :1;
        unsigned SMT2CPWUP              :1;
        unsigned SMT2CPRUP              :1;
    };
} SMT2STATbits_t;
extern volatile SMT2STATbits_t SMT2STATbits __at(0xDAC);
// bitfield macros
#define _SMT2STAT_AS_POSN                                   0x0
#define _SMT2STAT_AS_POSITION                               0x0
#define _SMT2STAT_AS_SIZE                                   0x1
#define _SMT2STAT_AS_LENGTH                                 0x1
#define _SMT2STAT_AS_MASK                                   0x1
#define _SMT2STAT_WS_POSN                                   0x1
#define _SMT2STAT_WS_POSITION                               0x1
#define _SMT2STAT_WS_SIZE                                   0x1
#define _SMT2STAT_WS_LENGTH                                 0x1
#define _SMT2STAT_WS_MASK                                   0x2
#define _SMT2STAT_TS_POSN                                   0x2
#define _SMT2STAT_TS_POSITION                               0x2
#define _SMT2STAT_TS_SIZE                                   0x1
#define _SMT2STAT_TS_LENGTH                                 0x1
#define _SMT2STAT_TS_MASK                                   0x4
#define _SMT2STAT_RST_POSN                                  0x5
#define _SMT2STAT_RST_POSITION                              0x5
#define _SMT2STAT_RST_SIZE                                  0x1
#define _SMT2STAT_RST_LENGTH                                0x1
#define _SMT2STAT_RST_MASK                                  0x20
#define _SMT2STAT_CPWUP_POSN                                0x6
#define _SMT2STAT_CPWUP_POSITION                            0x6
#define _SMT2STAT_CPWUP_SIZE                                0x1
#define _SMT2STAT_CPWUP_LENGTH                              0x1
#define _SMT2STAT_CPWUP_MASK                                0x40
#define _SMT2STAT_CPRUP_POSN                                0x7
#define _SMT2STAT_CPRUP_POSITION                            0x7
#define _SMT2STAT_CPRUP_SIZE                                0x1
#define _SMT2STAT_CPRUP_LENGTH                              0x1
#define _SMT2STAT_CPRUP_MASK                                0x80
#define _SMT2STAT_SMT2AS_POSN                               0x0
#define _SMT2STAT_SMT2AS_POSITION                           0x0
#define _SMT2STAT_SMT2AS_SIZE                               0x1
#define _SMT2STAT_SMT2AS_LENGTH                             0x1
#define _SMT2STAT_SMT2AS_MASK                               0x1
#define _SMT2STAT_SMT2WS_POSN                               0x1
#define _SMT2STAT_SMT2WS_POSITION                           0x1
#define _SMT2STAT_SMT2WS_SIZE                               0x1
#define _SMT2STAT_SMT2WS_LENGTH                             0x1
#define _SMT2STAT_SMT2WS_MASK                               0x2
#define _SMT2STAT_SMT2TS_POSN                               0x2
#define _SMT2STAT_SMT2TS_POSITION                           0x2
#define _SMT2STAT_SMT2TS_SIZE                               0x1
#define _SMT2STAT_SMT2TS_LENGTH                             0x1
#define _SMT2STAT_SMT2TS_MASK                               0x4
#define _SMT2STAT_SMT2RESET_POSN                            0x5
#define _SMT2STAT_SMT2RESET_POSITION                        0x5
#define _SMT2STAT_SMT2RESET_SIZE                            0x1
#define _SMT2STAT_SMT2RESET_LENGTH                          0x1
#define _SMT2STAT_SMT2RESET_MASK                            0x20
#define _SMT2STAT_SMT2CPWUP_POSN                            0x6
#define _SMT2STAT_SMT2CPWUP_POSITION                        0x6
#define _SMT2STAT_SMT2CPWUP_SIZE                            0x1
#define _SMT2STAT_SMT2CPWUP_LENGTH                          0x1
#define _SMT2STAT_SMT2CPWUP_MASK                            0x40
#define _SMT2STAT_SMT2CPRUP_POSN                            0x7
#define _SMT2STAT_SMT2CPRUP_POSITION                        0x7
#define _SMT2STAT_SMT2CPRUP_SIZE                            0x1
#define _SMT2STAT_SMT2CPRUP_LENGTH                          0x1
#define _SMT2STAT_SMT2CPRUP_MASK                            0x80

// Register: SMT2CLK
#define SMT2CLK SMT2CLK
extern volatile unsigned char           SMT2CLK             __at(0xDAD);
#ifndef _LIB_BUILD
asm("SMT2CLK equ 0DADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSEL                   :8;
    };
    struct {
        unsigned CSEL0                  :1;
        unsigned CSEL1                  :1;
        unsigned CSEL2                  :1;
    };
    struct {
        unsigned SMT2CSEL               :8;
    };
    struct {
        unsigned SMT2CSEL0              :1;
        unsigned SMT2CSEL1              :1;
        unsigned SMT2CSEL2              :1;
    };
} SMT2CLKbits_t;
