MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
extern volatile SSPDATPPSbits_t SSPDATPPSbits __at(0xE21);
// bitfield macros
#define _SSPDATPPS_SSPDATPPS_POSN                           0x0
#define _SSPDATPPS_SSPDATPPS_POSITION                       0x0
#define _SSPDATPPS_SSPDATPPS_SIZE                           0x5
#define _SSPDATPPS_SSPDATPPS_LENGTH                         0x5
#define _SSPDATPPS_SSPDATPPS_MASK                           0x1F
#define _SSPDATPPS_SSPDATPPS0_POSN                          0x0
#define _SSPDATPPS_SSPDATPPS0_POSITION                      0x0
#define _SSPDATPPS_SSPDATPPS0_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS0_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS0_MASK                          0x1
#define _SSPDATPPS_SSPDATPPS1_POSN                          0x1
#define _SSPDATPPS_SSPDATPPS1_POSITION                      0x1
#define _SSPDATPPS_SSPDATPPS1_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS1_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS1_MASK                          0x2
#define _SSPDATPPS_SSPDATPPS2_POSN                          0x2
#define _SSPDATPPS_SSPDATPPS2_POSITION                      0x2
#define _SSPDATPPS_SSPDATPPS2_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS2_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS2_MASK                          0x4
#define _SSPDATPPS_SSPDATPPS3_POSN                          0x3
#define _SSPDATPPS_SSPDATPPS3_POSITION                      0x3
#define _SSPDATPPS_SSPDATPPS3_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS3_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS3_MASK                          0x8
#define _SSPDATPPS_SSPDATPPS4_POSN                          0x4
#define _SSPDATPPS_SSPDATPPS4_POSITION                      0x4
#define _SSPDATPPS_SSPDATPPS4_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS4_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS4_MASK                          0x10

// Register: SSPSSPPS
#define SSPSSPPS SSPSSPPS
extern volatile unsigned char           SSPSSPPS            __at(0xE22);
#ifndef _LIB_BUILD
asm("SSPSSPPS equ 0E22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPSSPPS               :5;
    };
    struct {
        unsigned SSPSSPPS0              :1;
        unsigned SSPSSPPS1              :1;
        unsigned SSPSSPPS2              :1;
        unsigned SSPSSPPS3              :1;
        unsigned SSPSSPPS4              :1;
    };
} SSPSSPPSbits_t;
extern volatile SSPSSPPSbits_t SSPSSPPSbits __at(0xE22);
// bitfield macros
#define _SSPSSPPS_SSPSSPPS_POSN                             0x0
#define _SSPSSPPS_SSPSSPPS_POSITION                         0x0
#define _SSPSSPPS_SSPSSPPS_SIZE                             0x5
#define _SSPSSPPS_SSPSSPPS_LENGTH                           0x5
#define _SSPSSPPS_SSPSSPPS_MASK                             0x1F
#define _SSPSSPPS_SSPSSPPS0_POSN                            0x0
#define _SSPSSPPS_SSPSSPPS0_POSITION                        0x0
#define _SSPSSPPS_SSPSSPPS0_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS0_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS0_MASK                            0x1
#define _SSPSSPPS_SSPSSPPS1_POSN                            0x1
#define _SSPSSPPS_SSPSSPPS1_POSITION                        0x1
#define _SSPSSPPS_SSPSSPPS1_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS1_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS1_MASK                            0x2
#define _SSPSSPPS_SSPSSPPS2_POSN                            0x2
#define _SSPSSPPS_SSPSSPPS2_POSITION                        0x2
#define _SSPSSPPS_SSPSSPPS2_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS2_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS2_MASK                            0x4
#define _SSPSSPPS_SSPSSPPS3_POSN                            0x3
#define _SSPSSPPS_SSPSSPPS3_POSITION                        0x3
#define _SSPSSPPS_SSPSSPPS3_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS3_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS3_MASK                            0x8
#define _SSPSSPPS_SSPSSPPS4_POSN                            0x4
#define _SSPSSPPS_SSPSSPPS4_POSITION                        0x4
#define _SSPSSPPS_SSPSSPPS4_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS4_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS4_MASK                            0x10

// Register: ATCC2PPS
#define ATCC2PPS ATCC2PPS
extern volatile unsigned char           ATCC2PPS            __at(0xE23);
#ifndef _LIB_BUILD
asm("ATCC2PPS equ 0E23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ATCC2PPS               :5;
    };
    struct {
        unsigned ATCC2PPS0              :1;
        unsigned ATCC2PPS1              :1;
        unsigned ATCC2PPS2              :1;
        unsigned ATCC2PPS3              :1;
        unsigned ATCC2PPS4              :1;
    };
} ATCC2PPSbits_t;
extern volatile ATCC2PPSbits_t ATCC2PPSbits __at(0xE23);
// bitfield macros
#define _ATCC2PPS_ATCC2PPS_POSN                             0x0
#define _ATCC2PPS_ATCC2PPS_POSITION                         0x0
#define _ATCC2PPS_ATCC2PPS_SIZE                             0x5
#define _ATCC2PPS_ATCC2PPS_LENGTH                           0x5
#define _ATCC2PPS_ATCC2PPS_MASK                             0x1F
#define _ATCC2PPS_ATCC2PPS0_POSN                            0x0
#define _ATCC2PPS_ATCC2PPS0_POSITION                        0x0
#define _ATCC2PPS_ATCC2PPS0_SIZE                            0x1
#define _ATCC2PPS_ATCC2PPS0_LENGTH                          0x1
#define _ATCC2PPS_ATCC2PPS0_MASK                            0x1
#define _ATCC2PPS_ATCC2PPS1_POSN                            0x1
#define _ATCC2PPS_ATCC2PPS1_POSITION                        0x1
#define _ATCC2PPS_ATCC2PPS1_SIZE                            0x1
#define _ATCC2PPS_ATCC2PPS1_LENGTH                          0x1
#define _ATCC2PPS_ATCC2PPS1_MASK                            0x2
#define _ATCC2PPS_ATCC2PPS2_POSN                            0x2
#define _ATCC2PPS_ATCC2PPS2_POSITION                        0x2
#define _ATCC2PPS_ATCC2PPS2_SIZE                            0x1
#define _ATCC2PPS_ATCC2PPS2_LENGTH                          0x1
#define _ATCC2PPS_ATCC2PPS2_MASK                            0x4
#define _ATCC2PPS_ATCC2PPS3_POSN                            0x3
#define _ATCC2PPS_ATCC2PPS3_POSITION                        0x3
#define _ATCC2PPS_ATCC2PPS3_SIZE                            0x1
#define _ATCC2PPS_ATCC2PPS3_LENGTH                          0x1
#define _ATCC2PPS_ATCC2PPS3_MASK                            0x8
#define _ATCC2PPS_ATCC2PPS4_POSN                            0x4
#define _ATCC2PPS_ATCC2PPS4_POSITION                        0x4
#define _ATCC2PPS_ATCC2PPS4_SIZE                            0x1
#define _ATCC2PPS_ATCC2PPS4_LENGTH                          0x1
#define _ATCC2PPS_ATCC2PPS4_MASK                            0x10

// Register: RXPPS
#define RXPPS RXPPS
extern volatile unsigned char           RXPPS               __at(0xE24);
#ifndef _LIB_BUILD
asm("RXPPS equ 0E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXPPS                  :5;
    };
    struct {
        unsigned RXPPS0                 :1;
        unsigned RXPPS1                 :1;
        unsigned RXPPS2                 :1;
        unsigned RXPPS3                 :1;
        unsigned RXPPS4                 :1;
    };
} RXPPSbits_t;
extern volatile RXPPSbits_t RXPPSbits __at(0xE24);
// bitfield macros
#define _RXPPS_RXPPS_POSN                                   0x0
#define _RXPPS_RXPPS_POSITION                               0x0
#define _RXPPS_RXPPS_SIZE                                   0x5
#define _RXPPS_RXPPS_LENGTH                                 0x5
#define _RXPPS_RXPPS_MASK                                   0x1F
#define _RXPPS_RXPPS0_POSN                                  0x0
#define _RXPPS_RXPPS0_POSITION                              0x0
#define _RXPPS_RXPPS0_SIZE                                  0x1
#define _RXPPS_RXPPS0_LENGTH                                0x1
#define _RXPPS_RXPPS0_MASK                                  0x1
#define _RXPPS_RXPPS1_POSN                                  0x1
#define _RXPPS_RXPPS1_POSITION                              0x1
#define _RXPPS_RXPPS1_SIZE                                  0x1
#define _RXPPS_RXPPS1_LENGTH                                0x1
#define _RXPPS_RXPPS1_MASK                                  0x2
#define _RXPPS_RXPPS2_POSN                                  0x2
#define _RXPPS_RXPPS2_POSITION                              0x2
#define _RXPPS_RXPPS2_SIZE                                  0x1
#define _RXPPS_RXPPS2_LENGTH                                0x1
#define _RXPPS_RXPPS2_MASK                                  0x4
#define _RXPPS_RXPPS3_POSN                                  0x3
#define _RXPPS_RXPPS3_POSITION                              0x3
#define _RXPPS_RXPPS3_SIZE                                  0x1
#define _RXPPS_RXPPS3_LENGTH                                0x1
#define _RXPPS_RXPPS3_MASK                                  0x8
#define _RXPPS_RXPPS4_POSN                                  0x4
#define _RXPPS_RXPPS4_POSITION                              0x4
#define _RXPPS_RXPPS4_SIZE                                  0x1
#define _RXPPS_RXPPS4_LENGTH                                0x1
#define _RXPPS_RXPPS4_MASK                                  0x10

