MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
// Register: CKPPS
#define CKPPS CKPPS
extern volatile unsigned char           CKPPS               __at(0xE25);
#ifndef _LIB_BUILD
asm("CKPPS equ 0E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKPPS                  :5;
    };
    struct {
        unsigned CKPPS0                 :1;
        unsigned CKPPS1                 :1;
        unsigned CKPPS2                 :1;
        unsigned CKPPS3                 :1;
        unsigned CKPPS4                 :1;
    };
} CKPPSbits_t;
extern volatile CKPPSbits_t CKPPSbits __at(0xE25);
// bitfield macros
#define _CKPPS_CKPPS_POSN                                   0x0
#define _CKPPS_CKPPS_POSITION                               0x0
#define _CKPPS_CKPPS_SIZE                                   0x5
#define _CKPPS_CKPPS_LENGTH                                 0x5
#define _CKPPS_CKPPS_MASK                                   0x1F
#define _CKPPS_CKPPS0_POSN                                  0x0
#define _CKPPS_CKPPS0_POSITION                              0x0
#define _CKPPS_CKPPS0_SIZE                                  0x1
#define _CKPPS_CKPPS0_LENGTH                                0x1
#define _CKPPS_CKPPS0_MASK                                  0x1
#define _CKPPS_CKPPS1_POSN                                  0x1
#define _CKPPS_CKPPS1_POSITION                              0x1
#define _CKPPS_CKPPS1_SIZE                                  0x1
#define _CKPPS_CKPPS1_LENGTH                                0x1
#define _CKPPS_CKPPS1_MASK                                  0x2
#define _CKPPS_CKPPS2_POSN                                  0x2
#define _CKPPS_CKPPS2_POSITION                              0x2
#define _CKPPS_CKPPS2_SIZE                                  0x1
#define _CKPPS_CKPPS2_LENGTH                                0x1
#define _CKPPS_CKPPS2_MASK                                  0x4
#define _CKPPS_CKPPS3_POSN                                  0x3
#define _CKPPS_CKPPS3_POSITION                              0x3
#define _CKPPS_CKPPS3_SIZE                                  0x1
#define _CKPPS_CKPPS3_LENGTH                                0x1
#define _CKPPS_CKPPS3_MASK                                  0x8
#define _CKPPS_CKPPS4_POSN                                  0x4
#define _CKPPS_CKPPS4_POSITION                              0x4
#define _CKPPS_CKPPS4_SIZE                                  0x1
#define _CKPPS_CKPPS4_LENGTH                                0x1
#define _CKPPS_CKPPS4_MASK                                  0x10

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
extern volatile unsigned char           SMT1SIGPPS          __at(0xE26);
#ifndef _LIB_BUILD
asm("SMT1SIGPPS equ 0E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1SIGPPS             :5;
    };
    struct {
        unsigned SMT1SIGPPS0            :1;
        unsigned SMT1SIGPPS1            :1;
        unsigned SMT1SIGPPS2            :1;
        unsigned SMT1SIGPPS3            :1;
        unsigned SMT1SIGPPS4            :1;
    };
} SMT1SIGPPSbits_t;
extern volatile SMT1SIGPPSbits_t SMT1SIGPPSbits __at(0xE26);
// bitfield macros
#define _SMT1SIGPPS_SMT1SIGPPS_POSN                         0x0
#define _SMT1SIGPPS_SMT1SIGPPS_POSITION                     0x0
#define _SMT1SIGPPS_SMT1SIGPPS_SIZE                         0x5
#define _SMT1SIGPPS_SMT1SIGPPS_LENGTH                       0x5
#define _SMT1SIGPPS_SMT1SIGPPS_MASK                         0x1F
#define _SMT1SIGPPS_SMT1SIGPPS0_POSN                        0x0
#define _SMT1SIGPPS_SMT1SIGPPS0_POSITION                    0x0
#define _SMT1SIGPPS_SMT1SIGPPS0_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS0_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS0_MASK                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_POSN                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_POSITION                    0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_MASK                        0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_POSN                        0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_POSITION                    0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS2_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS2_MASK                        0x4
#define _SMT1SIGPPS_SMT1SIGPPS3_POSN                        0x3
#define _SMT1SIGPPS_SMT1SIGPPS3_POSITION                    0x3
#define _SMT1SIGPPS_SMT1SIGPPS3_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS3_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS3_MASK                        0x8
#define _SMT1SIGPPS_SMT1SIGPPS4_POSN                        0x4
#define _SMT1SIGPPS_SMT1SIGPPS4_POSITION                    0x4
#define _SMT1SIGPPS_SMT1SIGPPS4_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS4_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS4_MASK                        0x10

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
extern volatile unsigned char           SMT1WINPPS          __at(0xE27);
#ifndef _LIB_BUILD
asm("SMT1WINPPS equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1WINPPS             :5;
    };
    struct {
        unsigned SMTWINPPS0             :1;
        unsigned SMTWINPPS1             :1;
        unsigned SMTWINPPS2             :1;
        unsigned SMTWINPPS3             :1;
        unsigned SMTWINPPS4             :1;
    };
} SMT1WINPPSbits_t;
extern volatile SMT1WINPPSbits_t SMT1WINPPSbits __at(0xE27);
// bitfield macros
#define _SMT1WINPPS_SMT1WINPPS_POSN                         0x0
#define _SMT1WINPPS_SMT1WINPPS_POSITION                     0x0
#define _SMT1WINPPS_SMT1WINPPS_SIZE                         0x5
#define _SMT1WINPPS_SMT1WINPPS_LENGTH                       0x5
#define _SMT1WINPPS_SMT1WINPPS_MASK                         0x1F
#define _SMT1WINPPS_SMTWINPPS0_POSN                         0x0
#define _SMT1WINPPS_SMTWINPPS0_POSITION                     0x0
#define _SMT1WINPPS_SMTWINPPS0_SIZE                         0x1
#define _SMT1WINPPS_SMTWINPPS0_LENGTH                       0x1
#define _SMT1WINPPS_SMTWINPPS0_MASK                         0x1
#define _SMT1WINPPS_SMTWINPPS1_POSN                         0x1
#define _SMT1WINPPS_SMTWINPPS1_POSITION                     0x1
#define _SMT1WINPPS_SMTWINPPS1_SIZE                         0x1
#define _SMT1WINPPS_SMTWINPPS1_LENGTH                       0x1
#define _SMT1WINPPS_SMTWINPPS1_MASK                         0x2
#define _SMT1WINPPS_SMTWINPPS2_POSN                         0x2
#define _SMT1WINPPS_SMTWINPPS2_POSITION                     0x2
#define _SMT1WINPPS_SMTWINPPS2_SIZE                         0x1
#define _SMT1WINPPS_SMTWINPPS2_LENGTH                       0x1
#define _SMT1WINPPS_SMTWINPPS2_MASK                         0x4
#define _SMT1WINPPS_SMTWINPPS3_POSN                         0x3
#define _SMT1WINPPS_SMTWINPPS3_POSITION                     0x3
#define _SMT1WINPPS_SMTWINPPS3_SIZE                         0x1
#define _SMT1WINPPS_SMTWINPPS3_LENGTH                       0x1
#define _SMT1WINPPS_SMTWINPPS3_MASK                         0x8
#define _SMT1WINPPS_SMTWINPPS4_POSN                         0x4
#define _SMT1WINPPS_SMTWINPPS4_POSITION                     0x4
#define _SMT1WINPPS_SMTWINPPS4_SIZE                         0x1
#define _SMT1WINPPS_SMTWINPPS4_LENGTH                       0x1
#define _SMT1WINPPS_SMTWINPPS4_MASK                         0x10

