MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
extern volatile __bit                   AT1CP3S0            __at(0x44B0);	// @ (0x896 * 8 + 0)
#define                                 AT1CP3S0_bit        _BIT_ACCESS(AT1CSEL3,0)
// AT1CSEL3<AT1CP3S1>
extern volatile __bit                   AT1CP3S1            __at(0x44B1);	// @ (0x896 * 8 + 1)
#define                                 AT1CP3S1_bit        _BIT_ACCESS(AT1CSEL3,1)
// AT1CSEL3<AT1CP3S2>
extern volatile __bit                   AT1CP3S2            __at(0x44B2);	// @ (0x896 * 8 + 2)
#define                                 AT1CP3S2_bit        _BIT_ACCESS(AT1CSEL3,2)
// AT1CLK<AT1CS>
extern volatile __bit                   AT1CS               __at(0x4460);	// @ (0x88C * 8 + 0)
#define                                 AT1CS_bit           _BIT_ACCESS(AT1CLK,0)
// AT1CLK<AT1CS0>
extern volatile __bit                   AT1CS0              __at(0x4460);	// @ (0x88C * 8 + 0)
#define                                 AT1CS0_bit          _BIT_ACCESS(AT1CLK,0)
// AT1CON0<AT1EN>
extern volatile __bit                   AT1EN               __at(0x40A7);	// @ (0x814 * 8 + 7)
#define                                 AT1EN_bit           _BIT_ACCESS(AT1CON0,7)
// AT1ERRL<AT1ERR0>
extern volatile __bit                   AT1ERR0             __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 AT1ERR0_bit         _BIT_ACCESS(AT1ERRL,0)
// AT1ERRL<AT1ERR1>
extern volatile __bit                   AT1ERR1             __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 AT1ERR1_bit         _BIT_ACCESS(AT1ERRL,1)
// AT1ERRH<AT1ERR10>
extern volatile __bit                   AT1ERR10            __at(0x40EA);	// @ (0x81D * 8 + 2)
#define                                 AT1ERR10_bit        _BIT_ACCESS(AT1ERRH,2)
// AT1ERRH<AT1ERR11>
extern volatile __bit                   AT1ERR11            __at(0x40EB);	// @ (0x81D * 8 + 3)
#define                                 AT1ERR11_bit        _BIT_ACCESS(AT1ERRH,3)
// AT1ERRH<AT1ERR12>
extern volatile __bit                   AT1ERR12            __at(0x40EC);	// @ (0x81D * 8 + 4)
#define                                 AT1ERR12_bit        _BIT_ACCESS(AT1ERRH,4)
// AT1ERRH<AT1ERR13>
extern volatile __bit                   AT1ERR13            __at(0x40ED);	// @ (0x81D * 8 + 5)
#define                                 AT1ERR13_bit        _BIT_ACCESS(AT1ERRH,5)
// AT1ERRH<AT1ERR14>
extern volatile __bit                   AT1ERR14            __at(0x40EE);	// @ (0x81D * 8 + 6)
#define                                 AT1ERR14_bit        _BIT_ACCESS(AT1ERRH,6)
// AT1ERRH<AT1ERR15>
extern volatile __bit                   AT1ERR15            __at(0x40EF);	// @ (0x81D * 8 + 7)
#define                                 AT1ERR15_bit        _BIT_ACCESS(AT1ERRH,7)
// AT1ERRL<AT1ERR2>
extern volatile __bit                   AT1ERR2             __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 AT1ERR2_bit         _BIT_ACCESS(AT1ERRL,2)
// AT1ERRL<AT1ERR3>
extern volatile __bit                   AT1ERR3             __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 AT1ERR3_bit         _BIT_ACCESS(AT1ERRL,3)
// AT1ERRL<AT1ERR4>
extern volatile __bit                   AT1ERR4             __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 AT1ERR4_bit         _BIT_ACCESS(AT1ERRL,4)
// AT1ERRL<AT1ERR5>
extern volatile __bit                   AT1ERR5             __at(0x40E5);	// @ (0x81C * 8 + 5)
#define                                 AT1ERR5_bit         _BIT_ACCESS(AT1ERRL,5)
// AT1ERRL<AT1ERR6>
extern volatile __bit                   AT1ERR6             __at(0x40E6);	// @ (0x81C * 8 + 6)
#define                                 AT1ERR6_bit         _BIT_ACCESS(AT1ERRL,6)
// AT1ERRL<AT1ERR7>
extern volatile __bit                   AT1ERR7             __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 AT1ERR7_bit         _BIT_ACCESS(AT1ERRL,7)
// AT1ERRH<AT1ERR8>
extern volatile __bit                   AT1ERR8             __at(0x40E8);	// @ (0x81D * 8 + 0)
#define                                 AT1ERR8_bit         _BIT_ACCESS(AT1ERRH,0)
// AT1ERRH<AT1ERR9>
extern volatile __bit                   AT1ERR9             __at(0x40E9);	// @ (0x81D * 8 + 1)
#define                                 AT1ERR9_bit         _BIT_ACCESS(AT1ERRH,1)
// PIE5<AT1IE>
extern volatile __bit                   AT1IE               __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 AT1IE_bit           _BIT_ACCESS(PIE5,2)
// PIR5<AT1IF>
extern volatile __bit                   AT1IF               __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 AT1IF_bit           _BIT_ACCESS(PIR5,2)
// AT1MISSL<AT1MISS0>
extern volatile __bit                   AT1MISS0            __at(0x4070);	// @ (0x80E * 8 + 0)
#define                                 AT1MISS0_bit        _BIT_ACCESS(AT1MISSL,0)
// AT1MISSL<AT1MISS1>
extern volatile __bit                   AT1MISS1            __at(0x4071);	// @ (0x80E * 8 + 1)
#define                                 AT1MISS1_bit        _BIT_ACCESS(AT1MISSL,1)
// AT1MISSH<AT1MISS10>
extern volatile __bit                   AT1MISS10           __at(0x407A);	// @ (0x80F * 8 + 2)
#define                                 AT1MISS10_bit       _BIT_ACCESS(AT1MISSH,2)
// AT1MISSH<AT1MISS11>
extern volatile __bit                   AT1MISS11           __at(0x407B);	// @ (0x80F * 8 + 3)
#define                                 AT1MISS11_bit       _BIT_ACCESS(AT1MISSH,3)
// AT1MISSH<AT1MISS12>
extern volatile __bit                   AT1MISS12           __at(0x407C);	// @ (0x80F * 8 + 4)
#define                                 AT1MISS12_bit       _BIT_ACCESS(AT1MISSH,4)
// AT1MISSH<AT1MISS13>
extern volatile __bit                   AT1MISS13           __at(0x407D);	// @ (0x80F * 8 + 5)
#define                                 AT1MISS13_bit       _BIT_ACCESS(AT1MISSH,5)
// AT1MISSH<AT1MISS14>
extern volatile __bit                   AT1MISS14           __at(0x407E);	// @ (0x80F * 8 + 6)
#define                                 AT1MISS14_bit       _BIT_ACCESS(AT1MISSH,6)
// AT1MISSH<AT1MISS15>
extern volatile __bit                   AT1MISS15           __at(0x407F);	// @ (0x80F * 8 + 7)
#define                                 AT1MISS15_bit       _BIT_ACCESS(AT1MISSH,7)
// AT1MISSL<AT1MISS2>
extern volatile __bit                   AT1MISS2            __at(0x4072);	// @ (0x80E * 8 + 2)
#define                                 AT1MISS2_bit        _BIT_ACCESS(AT1MISSL,2)
// AT1MISSL<AT1MISS3>
extern volatile __bit                   AT1MISS3            __at(0x4073);	// @ (0x80E * 8 + 3)
#define                                 AT1MISS3_bit        _BIT_ACCESS(AT1MISSL,3)
// AT1MISSL<AT1MISS4>
extern volatile __bit                   AT1MISS4            __at(0x4074);	// @ (0x80E * 8 + 4)
#define                                 AT1MISS4_bit        _BIT_ACCESS(AT1MISSL,4)
// AT1MISSL<AT1MISS5>
extern volatile __bit                   AT1MISS5            __at(0x4075);	// @ (0x80E * 8 + 5)
#define                                 AT1MISS5_bit        _BIT_ACCESS(AT1MISSL,5)
// AT1MISSL<AT1MISS6>
extern volatile __bit                   AT1MISS6            __at(0x4076);	// @ (0x80E * 8 + 6)
#define                                 AT1MISS6_bit        _BIT_ACCESS(AT1MISSL,6)
// AT1MISSL<AT1MISS7>
extern volatile __bit                   AT1MISS7            __at(0x4077);	// @ (0x80E * 8 + 7)
#define                                 AT1MISS7_bit        _BIT_ACCESS(AT1MISSL,7)
// AT1MISSH<AT1MISS8>
extern volatile __bit                   AT1MISS8            __at(0x4078);	// @ (0x80F * 8 + 0)
#define                                 AT1MISS8_bit        _BIT_ACCESS(AT1MISSH,0)
// AT1MISSH<AT1MISS9>
extern volatile __bit                   AT1MISS9            __at(0x4079);	// @ (0x80F * 8 + 1)
#define                                 AT1MISS9_bit        _BIT_ACCESS(AT1MISSH,1)
// AT1IE0<AT1MISSIE>
extern volatile __bit                   AT1MISSIE           __at(0x40B9);	// @ (0x817 * 8 + 1)
#define                                 AT1MISSIE_bit       _BIT_ACCESS(AT1IE0,1)
// AT1IR0<AT1MISSIF>
extern volatile __bit                   AT1MISSIF           __at(0x40B1);	// @ (0x816 * 8 + 1)
#define                                 AT1MISSIF_bit       _BIT_ACCESS(AT1IR0,1)
// AT1CON0<AT1MODE>
extern volatile __bit                   AT1MODE             __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 AT1MODE_bit         _BIT_ACCESS(AT1CON0,0)
// AT1CON1<AT1MPP>
extern volatile __bit                   AT1MPP              __at(0x40AA);	// @ (0x815 * 8 + 2)
#define                                 AT1MPP_bit          _BIT_ACCESS(AT1CON1,2)
// AT1PERL<AT1PER0>
extern volatile __bit                   AT1PER0             __at(0x4080);	// @ (0x810 * 8 + 0)
#define                                 AT1PER0_bit         _BIT_ACCESS(AT1PERL,0)
// AT1PERL<AT1PER1>
extern volatile __bit                   AT1PER1             __at(0x4081);	// @ (0x810 * 8 + 1)
#define                                 AT1PER1_bit         _BIT_ACCESS(AT1PERL,1)
// AT1PERH<AT1PER10>
extern volatile __bit                   AT1PER10            __at(0x408A);	// @ (0x811 * 8 + 2)
#define                                 AT1PER10_bit        _BIT_ACCESS(AT1PERH,2)
// AT1PERH<AT1PER11>
extern volatile __bit                   AT1PER11            __at(0x408B);	// @ (0x811 * 8 + 3)
#define                                 AT1PER11_bit        _BIT_ACCESS(AT1PERH,3)
// AT1PERH<AT1PER12>
extern volatile __bit                   AT1PER12            __at(0x408C);	// @ (0x811 * 8 + 4)
#define                                 AT1PER12_bit        _BIT_ACCESS(AT1PERH,4)
// AT1PERH<AT1PER13>
extern volatile __bit                   AT1PER13            __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 AT1PER13_bit        _BIT_ACCESS(AT1PERH,5)
// AT1PERH<AT1PER14>
extern volatile __bit                   AT1PER14            __at(0x408E);	// @ (0x811 * 8 + 6)
#define                                 AT1PER14_bit        _BIT_ACCESS(AT1PERH,6)
// AT1PERL<AT1PER2>
extern volatile __bit                   AT1PER2             __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 AT1PER2_bit         _BIT_ACCESS(AT1PERL,2)
// AT1PERL<AT1PER3>
extern volatile __bit                   AT1PER3             __at(0x4083);	// @ (0x810 * 8 + 3)
#define                                 AT1PER3_bit         _BIT_ACCESS(AT1PERL,3)
// AT1PERL<AT1PER4>
extern volatile __bit                   AT1PER4             __at(0x4084);	// @ (0x810 * 8 + 4)
#define                                 AT1PER4_bit         _BIT_ACCESS(AT1PERL,4)
// AT1PERL<AT1PER5>
extern volatile __bit                   AT1PER5             __at(0x4085);	// @ (0x810 * 8 + 5)
#define                                 AT1PER5_bit         _BIT_ACCESS(AT1PERL,5)
// AT1PERL<AT1PER6>
extern volatile __bit                   AT1PER6             __at(0x4086);	// @ (0x810 * 8 + 6)
#define                                 AT1PER6_bit         _BIT_ACCESS(AT1PERL,6)
// AT1PERL<AT1PER7>
extern volatile __bit                   AT1PER7             __at(0x4087);	// @ (0x810 * 8 + 7)
#define                                 AT1PER7_bit         _BIT_ACCESS(AT1PERL,7)
// AT1PERH<AT1PER8>
extern volatile __bit                   AT1PER8             __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 AT1PER8_bit         _BIT_ACCESS(AT1PERH,0)
// AT1PERH<AT1PER9>
extern volatile __bit                   AT1PER9             __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 AT1PER9_bit         _BIT_ACCESS(AT1PERH,1)
// AT1IE0<AT1PERIE>
extern volatile __bit                   AT1PERIE            __at(0x40B8);	// @ (0x817 * 8 + 0)
#define                                 AT1PERIE_bit        _BIT_ACCESS(AT1IE0,0)
// AT1IR0<AT1PERIF>
extern volatile __bit                   AT1PERIF            __at(0x40B0);	// @ (0x816 * 8 + 0)
#define                                 AT1PERIF_bit        _BIT_ACCESS(AT1IR0,0)
// AT1CON1<AT1PHP>
extern volatile __bit                   AT1PHP              __at(0x40AE);	// @ (0x815 * 8 + 6)
#define                                 AT1PHP_bit          _BIT_ACCESS(AT1CON1,6)
// AT1PHSL<AT1PHS0>
extern volatile __bit                   AT1PHS0             __at(0x4090);	// @ (0x812 * 8 + 0)
#define                                 AT1PHS0_bit         _BIT_ACCESS(AT1PHSL,0)
// AT1PHSL<AT1PHS1>
extern volatile __bit                   AT1PHS1             __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 AT1PHS1_bit         _BIT_ACCESS(AT1PHSL,1)
// AT1PHSL<AT1PHS2>
extern volatile __bit                   AT1PHS2             __at(0x4092);	// @ (0x812 * 8 + 2)
#define                                 AT1PHS2_bit         _BIT_ACCESS(AT1PHSL,2)
// AT1PHSL<AT1PHS3>
extern volatile __bit                   AT1PHS3             __at(0x4093);	// @ (0x812 * 8 + 3)
#define                                 AT1PHS3_bit         _BIT_ACCESS(AT1PHSL,3)
// AT1PHSL<AT1PHS4>
extern volatile __bit                   AT1PHS4             __at(0x4094);	// @ (0x812 * 8 + 4)
#define                                 AT1PHS4_bit         _BIT_ACCESS(AT1PHSL,4)
// AT1PHSL<AT1PHS5>
extern volatile __bit                   AT1PHS5             __at(0x4095);	// @ (0x812 * 8 + 5)
#define                                 AT1PHS5_bit         _BIT_ACCESS(AT1PHSL,5)
// AT1PHSL<AT1PHS6>
extern volatile __bit                   AT1PHS6             __at(0x4096);	// @ (0x812 * 8 + 6)
#define                                 AT1PHS6_bit         _BIT_ACCESS(AT1PHSL,6)
// AT1PHSL<AT1PHS7>
extern volatile __bit                   AT1PHS7             __at(0x4097);	// @ (0x812 * 8 + 7)
#define                                 AT1PHS7_bit         _BIT_ACCESS(AT1PHSL,7)
// AT1PHSH<AT1PHS8>
extern volatile __bit                   AT1PHS8             __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 AT1PHS8_bit         _BIT_ACCESS(AT1PHSH,0)
// AT1PHSH<AT1PHS9>
extern volatile __bit                   AT1PHS9             __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 AT1PHS9_bit         _BIT_ACCESS(AT1PHSH,1)
// AT1IE0<AT1PHSIE>
extern volatile __bit                   AT1PHSIE            __at(0x40BA);	// @ (0x817 * 8 + 2)
#define                                 AT1PHSIE_bit        _BIT_ACCESS(AT1IE0,2)
// AT1IR0<AT1PHSIF>
extern volatile __bit                   AT1PHSIF            __at(0x40B2);	// @ (0x816 * 8 + 2)
#define                                 AT1PHSIF_bit        _BIT_ACCESS(AT1IR0,2)
// AT1CON0<AT1POL>
extern volatile __bit                   AT1POL              __at(0x40A3);	// @ (0x814 * 8 + 3)
#define                                 AT1POL_bit          _BIT_ACCESS(AT1CON0,3)
// AT1PERH<AT1POV>
extern volatile __bit                   AT1POV              __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 AT1POV_bit          _BIT_ACCESS(AT1PERH,7)
// AT1CON0<AT1PREC>
extern volatile __bit                   AT1PREC             __at(0x40A6);	// @ (0x814 * 8 + 6)
#define                                 AT1PREC_bit         _BIT_ACCESS(AT1CON0,6)
// AT1CON1<AT1PRP>
extern volatile __bit                   AT1PRP              __at(0x40AC);	// @ (0x815 * 8 + 4)
#define                                 AT1PRP_bit          _BIT_ACCESS(AT1CON1,4)
// AT1CON0<AT1PS0>
extern volatile __bit                   AT1PS0              __at(0x40A4);	// @ (0x814 * 8 + 4)
#define                                 AT1PS0_bit          _BIT_ACCESS(AT1CON0,4)
// AT1CON0<AT1PS1>
extern volatile __bit                   AT1PS1              __at(0x40A5);	// @ (0x814 * 8 + 5)
#define                                 AT1PS1_bit          _BIT_ACCESS(AT1CON0,5)
// AT1RESL<AT1RES0>
extern volatile __bit                   AT1RES0             __at(0x4060);	// @ (0x80C * 8 + 0)
#define                                 AT1RES0_bit         _BIT_ACCESS(AT1RESL,0)
// AT1RESL<AT1RES1>
extern volatile __bit                   AT1RES1             __at(0x4061);	// @ (0x80C * 8 + 1)
#define                                 AT1RES1_bit         _BIT_ACCESS(AT1RESL,1)
// AT1RESL<AT1RES2>
extern volatile __bit                   AT1RES2             __at(0x4062);	// @ (0x80C * 8 + 2)
#define                                 AT1RES2_bit         _BIT_ACCESS(AT1RESL,2)
// AT1RESL<AT1RES3>
extern volatile __bit                   AT1RES3             __at(0x4063);	// @ (0x80C * 8 + 3)
#define                                 AT1RES3_bit         _BIT_ACCESS(AT1RESL,3)
// AT1RESL<AT1RES4>
extern volatile __bit                   AT1RES4             __at(0x4064);	// @ (0x80C * 8 + 4)
#define                                 AT1RES4_bit         _BIT_ACCESS(AT1RESL,4)
// AT1RESL<AT1RES5>
extern volatile __bit                   AT1RES5             __at(0x4065);	// @ (0x80C * 8 + 5)
#define                                 AT1RES5_bit         _BIT_ACCESS(AT1RESL,5)
// AT1RESL<AT1RES6>
extern volatile __bit                   AT1RES6             __at(0x4066);	// @ (0x80C * 8 + 6)
#define                                 AT1RES6_bit         _BIT_ACCESS(AT1RESL,6)
// AT1RESL<AT1RES7>
extern volatile __bit                   AT1RES7             __at(0x4067);	// @ (0x80C * 8 + 7)
#define                                 AT1RES7_bit         _BIT_ACCESS(AT1RESL,7)
// AT1RESH<AT1RES8>
extern volatile __bit                   AT1RES8             __at(0x4068);	// @ (0x80D * 8 + 0)
#define                                 AT1RES8_bit         _BIT_ACCESS(AT1RESH,0)
// AT1RESH<AT1RES9>
extern volatile __bit                   AT1RES9             __at(0x4069);	// @ (0x80D * 8 + 1)
#define                                 AT1RES9_bit         _BIT_ACCESS(AT1RESH,1)
// AT1SIG<AT1SSEL0>
extern volatile __bit                   AT1SSEL0            __at(0x4468);	// @ (0x88D * 8 + 0)
#define                                 AT1SSEL0_bit        _BIT_ACCESS(AT1SIG,0)
// AT1SIG<AT1SSEL1>
extern volatile __bit                   AT1SSEL1            __at(0x4469);	// @ (0x88D * 8 + 1)
#define                                 AT1SSEL1_bit        _BIT_ACCESS(AT1SIG,1)
// AT1SIG<AT1SSEL2>
extern volatile __bit                   AT1SSEL2            __at(0x446A);	// @ (0x88D * 8 + 2)
#define                                 AT1SSEL2_bit        _BIT_ACCESS(AT1SIG,2)
// AT1STPTL<AT1STPT0>
extern volatile __bit                   AT1STPT0            __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 AT1STPT0_bit        _BIT_ACCESS(AT1STPTL,0)
// AT1STPTL<AT1STPT1>
extern volatile __bit                   AT1STPT1            __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 AT1STPT1_bit        _BIT_ACCESS(AT1STPTL,1)
// AT1STPTH<AT1STPT10>
extern volatile __bit                   AT1STPT10           __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 AT1STPT10_bit       _BIT_ACCESS(AT1STPTH,2)
// AT1STPTH<AT1STPT11>
extern volatile __bit                   AT1STPT11           __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 AT1STPT11_bit       _BIT_ACCESS(AT1STPTH,3)
// AT1STPTH<AT1STPT12>
extern volatile __bit                   AT1STPT12           __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 AT1STPT12_bit       _BIT_ACCESS(AT1STPTH,4)
// AT1STPTH<AT1STPT13>
extern volatile __bit                   AT1STPT13           __at(0x40DD);	// @ (0x81B * 8 + 5)
#define                                 AT1STPT13_bit       _BIT_ACCESS(AT1STPTH,5)
// AT1STPTH<AT1STPT14>
extern volatile __bit                   AT1STPT14           __at(0x40DE);	// @ (0x81B * 8 + 6)
#define                                 AT1STPT14_bit       _BIT_ACCESS(AT1STPTH,6)
// AT1STPTL<AT1STPT2>
extern volatile __bit                   AT1STPT2            __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 AT1STPT2_bit        _BIT_ACCESS(AT1STPTL,2)
// AT1STPTL<AT1STPT3>
extern volatile __bit                   AT1STPT3            __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 AT1STPT3_bit        _BIT_ACCESS(AT1STPTL,3)
// AT1STPTL<AT1STPT4>
extern volatile __bit                   AT1STPT4            __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 AT1STPT4_bit        _BIT_ACCESS(AT1STPTL,4)
// AT1STPTL<AT1STPT5>
extern volatile __bit                   AT1STPT5            __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 AT1STPT5_bit        _BIT_ACCESS(AT1STPTL,5)
// AT1STPTL<AT1STPT6>
extern volatile __bit                   AT1STPT6            __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 AT1STPT6_bit        _BIT_ACCESS(AT1STPTL,6)
// AT1STPTL<AT1STPT7>
extern volatile __bit                   AT1STPT7            __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 AT1STPT7_bit        _BIT_ACCESS(AT1STPTL,7)
// AT1STPTH<AT1STPT8>
extern volatile __bit                   AT1STPT8            __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 AT1STPT8_bit        _BIT_ACCESS(AT1STPTH,0)
// AT1STPTH<AT1STPT9>
extern volatile __bit                   AT1STPT9            __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 AT1STPT9_bit        _BIT_ACCESS(AT1STPTH,1)
// AT1CON1<AT1VALID>
extern volatile __bit                   AT1VALID            __at(0x40A8);	// @ (0x815 * 8 + 0)
#define                                 AT1VALID_bit        _BIT_ACCESS(AT1CON1,0)
// ATCC1PPS<ATCC1PPS0>
extern volatile __bit                   ATCC1PPS0           __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 ATCC1PPS0_bit       _BIT_ACCESS(ATCC1PPS,0)
// ATCC1PPS<ATCC1PPS1>
extern volatile __bit                   ATCC1PPS1           __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 ATCC1PPS1_bit       _BIT_ACCESS(ATCC1PPS,1)
// ATCC1PPS<ATCC1PPS2>
extern volatile __bit                   ATCC1PPS2           __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 ATCC1PPS2_bit       _BIT_ACCESS(ATCC1PPS,2)
// ATCC1PPS<ATCC1PPS3>
extern volatile __bit                   ATCC1PPS3           __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 ATCC1PPS3_bit       _BIT_ACCESS(ATCC1PPS,3)
// ATCC1PPS<ATCC1PPS4>
extern volatile __bit                   ATCC1PPS4           __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 ATCC1PPS4_bit       _BIT_ACCESS(ATCC1PPS,4)
// ATCC2PPS<ATCC2PPS0>
extern volatile __bit                   ATCC2PPS0           __at(0x7118);	// @ (0xE23 * 8 + 0)
#define                                 ATCC2PPS0_bit       _BIT_ACCESS(ATCC2PPS,0)
// ATCC2PPS<ATCC2PPS1>
extern volatile __bit                   ATCC2PPS1           __at(0x7119);	// @ (0xE23 * 8 + 1)
#define                                 ATCC2PPS1_bit       _BIT_ACCESS(ATCC2PPS,1)
// ATCC2PPS<ATCC2PPS2>
extern volatile __bit                   ATCC2PPS2           __at(0x711A);	// @ (0xE23 * 8 + 2)
#define                                 ATCC2PPS2_bit       _BIT_ACCESS(ATCC2PPS,2)
// ATCC2PPS<ATCC2PPS3>
extern volatile __bit                   ATCC2PPS3           __at(0x711B);	// @ (0xE23 * 8 + 3)
#define                                 ATCC2PPS3_bit       _BIT_ACCESS(ATCC2PPS,3)
// ATCC2PPS<ATCC2PPS4>
extern volatile __bit                   ATCC2PPS4           __at(0x711C);	// @ (0xE23 * 8 + 4)
#define                                 ATCC2PPS4_bit       _BIT_ACCESS(ATCC2PPS,4)
// ATCC3PPS<ATCC3PPS0>
extern volatile __bit                   ATCC3PPS0           __at(0x7170);	// @ (0xE2E * 8 + 0)
#define                                 ATCC3PPS0_bit       _BIT_ACCESS(ATCC3PPS,0)
// ATCC3PPS<ATCC3PPS1>
extern volatile __bit                   ATCC3PPS1           __at(0x7171);	// @ (0xE2E * 8 + 1)
