MikroElektronika/core_packages/PIC/XC8/def/PIC16F1618/mcu.h
extern volatile __bit                   LC2G1D4N            __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 LC2G1D4N_bit        _BIT_ACCESS(CLC2GLS0,6)
// CLC2GLS0<LC2G1D4T>
extern volatile __bit                   LC2G1D4T            __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 LC2G1D4T_bit        _BIT_ACCESS(CLC2GLS0,7)
// CLC2POL<LC2G1POL>
extern volatile __bit                   LC2G1POL            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 LC2G1POL_bit        _BIT_ACCESS(CLC2POL,0)
// CLC2GLS1<LC2G2D1N>
extern volatile __bit                   LC2G2D1N            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 LC2G2D1N_bit        _BIT_ACCESS(CLC2GLS1,0)
// CLC2GLS1<LC2G2D1T>
extern volatile __bit                   LC2G2D1T            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 LC2G2D1T_bit        _BIT_ACCESS(CLC2GLS1,1)
// CLC2GLS1<LC2G2D2N>
extern volatile __bit                   LC2G2D2N            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 LC2G2D2N_bit        _BIT_ACCESS(CLC2GLS1,2)
// CLC2GLS1<LC2G2D2T>
extern volatile __bit                   LC2G2D2T            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 LC2G2D2T_bit        _BIT_ACCESS(CLC2GLS1,3)
// CLC2GLS1<LC2G2D3N>
extern volatile __bit                   LC2G2D3N            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 LC2G2D3N_bit        _BIT_ACCESS(CLC2GLS1,4)
// CLC2GLS1<LC2G2D3T>
extern volatile __bit                   LC2G2D3T            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 LC2G2D3T_bit        _BIT_ACCESS(CLC2GLS1,5)
// CLC2GLS1<LC2G2D4N>
extern volatile __bit                   LC2G2D4N            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 LC2G2D4N_bit        _BIT_ACCESS(CLC2GLS1,6)
// CLC2GLS1<LC2G2D4T>
extern volatile __bit                   LC2G2D4T            __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 LC2G2D4T_bit        _BIT_ACCESS(CLC2GLS1,7)
// CLC2POL<LC2G2POL>
extern volatile __bit                   LC2G2POL            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 LC2G2POL_bit        _BIT_ACCESS(CLC2POL,1)
// CLC2GLS2<LC2G3D1N>
extern volatile __bit                   LC2G3D1N            __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 LC2G3D1N_bit        _BIT_ACCESS(CLC2GLS2,0)
// CLC2GLS2<LC2G3D1T>
extern volatile __bit                   LC2G3D1T            __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 LC2G3D1T_bit        _BIT_ACCESS(CLC2GLS2,1)
// CLC2GLS2<LC2G3D2N>
extern volatile __bit                   LC2G3D2N            __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 LC2G3D2N_bit        _BIT_ACCESS(CLC2GLS2,2)
// CLC2GLS2<LC2G3D2T>
extern volatile __bit                   LC2G3D2T            __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 LC2G3D2T_bit        _BIT_ACCESS(CLC2GLS2,3)
// CLC2GLS2<LC2G3D3N>
extern volatile __bit                   LC2G3D3N            __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 LC2G3D3N_bit        _BIT_ACCESS(CLC2GLS2,4)
// CLC2GLS2<LC2G3D3T>
extern volatile __bit                   LC2G3D3T            __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 LC2G3D3T_bit        _BIT_ACCESS(CLC2GLS2,5)
// CLC2GLS2<LC2G3D4N>
extern volatile __bit                   LC2G3D4N            __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 LC2G3D4N_bit        _BIT_ACCESS(CLC2GLS2,6)
// CLC2GLS2<LC2G3D4T>
extern volatile __bit                   LC2G3D4T            __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 LC2G3D4T_bit        _BIT_ACCESS(CLC2GLS2,7)
// CLC2POL<LC2G3POL>
extern volatile __bit                   LC2G3POL            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 LC2G3POL_bit        _BIT_ACCESS(CLC2POL,2)
// CLC2GLS3<LC2G4D1N>
extern volatile __bit                   LC2G4D1N            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 LC2G4D1N_bit        _BIT_ACCESS(CLC2GLS3,0)
// CLC2GLS3<LC2G4D1T>
extern volatile __bit                   LC2G4D1T            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 LC2G4D1T_bit        _BIT_ACCESS(CLC2GLS3,1)
// CLC2GLS3<LC2G4D2N>
extern volatile __bit                   LC2G4D2N            __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 LC2G4D2N_bit        _BIT_ACCESS(CLC2GLS3,2)
// CLC2GLS3<LC2G4D2T>
extern volatile __bit                   LC2G4D2T            __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 LC2G4D2T_bit        _BIT_ACCESS(CLC2GLS3,3)
// CLC2GLS3<LC2G4D3N>
extern volatile __bit                   LC2G4D3N            __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 LC2G4D3N_bit        _BIT_ACCESS(CLC2GLS3,4)
// CLC2GLS3<LC2G4D3T>
extern volatile __bit                   LC2G4D3T            __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 LC2G4D3T_bit        _BIT_ACCESS(CLC2GLS3,5)
// CLC2GLS3<LC2G4D4N>
extern volatile __bit                   LC2G4D4N            __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 LC2G4D4N_bit        _BIT_ACCESS(CLC2GLS3,6)
// CLC2GLS3<LC2G4D4T>
extern volatile __bit                   LC2G4D4T            __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 LC2G4D4T_bit        _BIT_ACCESS(CLC2GLS3,7)
// CLC2POL<LC2G4POL>
extern volatile __bit                   LC2G4POL            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 LC2G4POL_bit        _BIT_ACCESS(CLC2POL,3)
// CLC2CON<LC2INTN>
extern volatile __bit                   LC2INTN             __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 LC2INTN_bit         _BIT_ACCESS(CLC2CON,3)
// CLC2CON<LC2INTP>
extern volatile __bit                   LC2INTP             __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 LC2INTP_bit         _BIT_ACCESS(CLC2CON,4)
// CLC2CON<LC2MODE0>
extern volatile __bit                   LC2MODE0            __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 LC2MODE0_bit        _BIT_ACCESS(CLC2CON,0)
// CLC2CON<LC2MODE1>
extern volatile __bit                   LC2MODE1            __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 LC2MODE1_bit        _BIT_ACCESS(CLC2CON,1)
// CLC2CON<LC2MODE2>
extern volatile __bit                   LC2MODE2            __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 LC2MODE2_bit        _BIT_ACCESS(CLC2CON,2)
// CLC2CON<LC2OUT>
extern volatile __bit                   LC2OUT              __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 LC2OUT_bit          _BIT_ACCESS(CLC2CON,5)
// CLC2POL<LC2POL>
extern volatile __bit                   LC2POL              __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 LC2POL_bit          _BIT_ACCESS(CLC2POL,7)
// CWG1CON0<LD>
extern volatile __bit                   LD                  __at(0x34B6);	// @ (0x696 * 8 + 6)
#define                                 LD_bit              _BIT_ACCESS(CWG1CON0,6)
// SCANLADRL<LDAR0>
extern volatile __bit                   LDAR0               __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 LDAR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LDAR1>
extern volatile __bit                   LDAR1               __at(0x38C1);	// @ (0x718 * 8 + 1)
#define                                 LDAR1_bit           _BIT_ACCESS(SCANLADRL,1)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(PMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// AT1MISSL<MISS0>
extern volatile __bit                   MISS0               __at(0x4070);	// @ (0x80E * 8 + 0)
#define                                 MISS0_bit           _BIT_ACCESS(AT1MISSL,0)
// AT1MISSL<MISS1>
extern volatile __bit                   MISS1               __at(0x4071);	// @ (0x80E * 8 + 1)
#define                                 MISS1_bit           _BIT_ACCESS(AT1MISSL,1)
// AT1MISSH<MISS10>
extern volatile __bit                   MISS10              __at(0x407A);	// @ (0x80F * 8 + 2)
#define                                 MISS10_bit          _BIT_ACCESS(AT1MISSH,2)
// AT1MISSH<MISS11>
extern volatile __bit                   MISS11              __at(0x407B);	// @ (0x80F * 8 + 3)
#define                                 MISS11_bit          _BIT_ACCESS(AT1MISSH,3)
// AT1MISSH<MISS12>
extern volatile __bit                   MISS12              __at(0x407C);	// @ (0x80F * 8 + 4)
#define                                 MISS12_bit          _BIT_ACCESS(AT1MISSH,4)
// AT1MISSH<MISS13>
extern volatile __bit                   MISS13              __at(0x407D);	// @ (0x80F * 8 + 5)
#define                                 MISS13_bit          _BIT_ACCESS(AT1MISSH,5)
// AT1MISSH<MISS14>
extern volatile __bit                   MISS14              __at(0x407E);	// @ (0x80F * 8 + 6)
#define                                 MISS14_bit          _BIT_ACCESS(AT1MISSH,6)
// AT1MISSH<MISS15>
extern volatile __bit                   MISS15              __at(0x407F);	// @ (0x80F * 8 + 7)
#define                                 MISS15_bit          _BIT_ACCESS(AT1MISSH,7)
// AT1MISSL<MISS2>
extern volatile __bit                   MISS2               __at(0x4072);	// @ (0x80E * 8 + 2)
#define                                 MISS2_bit           _BIT_ACCESS(AT1MISSL,2)
// AT1MISSL<MISS3>
extern volatile __bit                   MISS3               __at(0x4073);	// @ (0x80E * 8 + 3)
#define                                 MISS3_bit           _BIT_ACCESS(AT1MISSL,3)
// AT1MISSL<MISS4>
extern volatile __bit                   MISS4               __at(0x4074);	// @ (0x80E * 8 + 4)
#define                                 MISS4_bit           _BIT_ACCESS(AT1MISSL,4)
// AT1MISSL<MISS5>
extern volatile __bit                   MISS5               __at(0x4075);	// @ (0x80E * 8 + 5)
#define                                 MISS5_bit           _BIT_ACCESS(AT1MISSL,5)
// AT1MISSL<MISS6>
extern volatile __bit                   MISS6               __at(0x4076);	// @ (0x80E * 8 + 6)
#define                                 MISS6_bit           _BIT_ACCESS(AT1MISSL,6)
// AT1MISSL<MISS7>
extern volatile __bit                   MISS7               __at(0x4077);	// @ (0x80E * 8 + 7)
#define                                 MISS7_bit           _BIT_ACCESS(AT1MISSL,7)
// AT1MISSH<MISS8>
extern volatile __bit                   MISS8               __at(0x4078);	// @ (0x80F * 8 + 0)
#define                                 MISS8_bit           _BIT_ACCESS(AT1MISSH,0)
// AT1MISSH<MISS9>
extern volatile __bit                   MISS9               __at(0x4079);	// @ (0x80F * 8 + 1)
#define                                 MISS9_bit           _BIT_ACCESS(AT1MISSH,1)
// CLCDATA<MLC1OUT>
extern volatile __bit                   MLC1OUT             __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// AT1CON0<MODE>
extern volatile __bit                   MODE                __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 MODE_bit            _BIT_ACCESS(AT1CON0,0)
// AT1CON1<MPP>
extern volatile __bit                   MPP                 __at(0x40AA);	// @ (0x815 * 8 + 2)
#define                                 MPP_bit             _BIT_ACCESS(AT1CON1,2)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONB<ODB4>
extern volatile __bit                   ODB4                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODB4_bit            _BIT_ACCESS(ODCONB,4)
// ODCONB<ODB5>
extern volatile __bit                   ODB5                __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODB5_bit            _BIT_ACCESS(ODCONB,5)
// ODCONB<ODB6>
extern volatile __bit                   ODB6                __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODB6_bit            _BIT_ACCESS(ODCONB,6)
// ODCONB<ODB7>
extern volatile __bit                   ODB7                __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODB7_bit            _BIT_ACCESS(ODCONB,7)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// ODCONC<ODC6>
extern volatile __bit                   ODC6                __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODC6_bit            _BIT_ACCESS(ODCONC,6)
// ODCONC<ODC7>
extern volatile __bit                   ODC7                __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODC7_bit            _BIT_ACCESS(ODCONC,7)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// PID1OUTLL<OUT0>
extern volatile __bit                   OUT0                __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(PID1OUTLL,0)
// PID1OUTLL<OUT1>
extern volatile __bit                   OUT1                __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(PID1OUTLL,1)
// PID1OUTLH<OUT10>
extern volatile __bit                   OUT10               __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(PID1OUTLH,2)
// PID1OUTLH<OUT11>
extern volatile __bit                   OUT11               __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(PID1OUTLH,3)
// PID1OUTLH<OUT12>
extern volatile __bit                   OUT12               __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(PID1OUTLH,4)
// PID1OUTLH<OUT13>
extern volatile __bit                   OUT13               __at(0x2CBD);	// @ (0x597 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(PID1OUTLH,5)
// PID1OUTLH<OUT14>
extern volatile __bit                   OUT14               __at(0x2CBE);	// @ (0x597 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(PID1OUTLH,6)
// PID1OUTLH<OUT15>
extern volatile __bit                   OUT15               __at(0x2CBF);	// @ (0x597 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(PID1OUTLH,7)
// PID1OUTHL<OUT16>
extern volatile __bit                   OUT16               __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(PID1OUTHL,0)
// PID1OUTHL<OUT17>
extern volatile __bit                   OUT17               __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(PID1OUTHL,1)
// PID1OUTHL<OUT18>
extern volatile __bit                   OUT18               __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(PID1OUTHL,2)
// PID1OUTHL<OUT19>
extern volatile __bit                   OUT19               __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(PID1OUTHL,3)
// PID1OUTLL<OUT2>
extern volatile __bit                   OUT2                __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(PID1OUTLL,2)
// PID1OUTHL<OUT20>
extern volatile __bit                   OUT20               __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(PID1OUTHL,4)
// PID1OUTHL<OUT21>
extern volatile __bit                   OUT21               __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(PID1OUTHL,5)
// PID1OUTHL<OUT22>
extern volatile __bit                   OUT22               __at(0x2CC6);	// @ (0x598 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(PID1OUTHL,6)
// PID1OUTHL<OUT23>
extern volatile __bit                   OUT23               __at(0x2CC7);	// @ (0x598 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(PID1OUTHL,7)
// PID1OUTHH<OUT24>
extern volatile __bit                   OUT24               __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(PID1OUTHH,0)
// PID1OUTHH<OUT25>
extern volatile __bit                   OUT25               __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(PID1OUTHH,1)
// PID1OUTHH<OUT26>
extern volatile __bit                   OUT26               __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(PID1OUTHH,2)
// PID1OUTHH<OUT27>
extern volatile __bit                   OUT27               __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(PID1OUTHH,3)
// PID1OUTHH<OUT28>
extern volatile __bit                   OUT28               __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(PID1OUTHH,4)
// PID1OUTHH<OUT29>
extern volatile __bit                   OUT29               __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(PID1OUTHH,5)
// PID1OUTLL<OUT3>
extern volatile __bit                   OUT3                __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(PID1OUTLL,3)
// PID1OUTHH<OUT30>
extern volatile __bit                   OUT30               __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(PID1OUTHH,6)
// PID1OUTHH<OUT31>
extern volatile __bit                   OUT31               __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(PID1OUTHH,7)
// PID1OUTU<OUT32>
